{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "Salil Parekh",
  "language": "en",
  "home_page_url": "https://salilparekh.work",
  "feed_url": "https://example.com/feed/feed.json",
  "description": "Salil Parekh is a design researcher and creative technologist. He is currently working on creating a planet-centered machine intelligence at The New School, New York.",
  "author": {
    "name": "Salil Parekh",
    "url": "https://salilparekh.work"
  },
  "items": [{
      "id": "https://salilparekh.work/posts/simulated-life/",
      "url": "https://salilparekh.work/posts/simulated-life/",
      "title": "Simulated Life",
      "content_html": "<p>Like many, my journey into creative coding was guided by Daniel Shiffman’s Nature of Code. When it first came out in 2012, it was one of the few resources which explained the core concepts of coding in an easy to understand manner. At the end of a chapter, Daniel urged the reader to implement the concepts by creating a ‘pond’, an ecosystem with intelligent agents which would act of their own accord, and employ a genetic system, much like real life. I never got around to actually creating this ecosystem, partly because it was a difficult undertaking.</p>\n<p><img src=\"https://salilparekh.work/img/sl-1.png\" alt=\"EyeMyth Poster\" /><br />\n<em>My first attempt at creating a 'pond'</em></p>\n<p>I tried to create a few variations, but never managed to figure out how to create intelligent agents capable of interacting with each other. My interest in creating an artificial ecosystem didn’t fade, and I finally decided to create one, but with a unique tweak. Most Artificial Life (AL) systems replicated reality, or at the very least, followed the same rules of predation, and natural selection. I wanted to explore alternative metrics of natural selection. Would being nice to each other help the species as a whole thrive? Or is the idea of the selfish gene far too efficient?</p>\n<p><span>My intent with the AL system was to create an homeostatic system which would then be induced with behaviours such as sharing, community, and respect for the environment, with the hopes of comparing the tweaked systems with the baseline to observe if there were any changes, if at all.</span></p>\n<p>I took an iterative approach toward creating the AL ecosystem, adding features and behaviours to the system layer by layer. The first iteration consisted of two types of entities, an agent (square) and a food particle (circle).</p>\n<p><img src=\"https://salilparekh.work/img/sl-3.png\" alt=\"EyeMyth Poster\" /><br />\n<em><strong>Iteration 1</strong> : Agents (squares) looking for food (circles). Hunger denoted by color (black=hungry, white=full).</em></p>\n<p><img src=\"https://salilparekh.work/img/sl-4.png\" alt=\"EyeMyth Poster\" /><br />\n<em><strong>Iteration 2</strong>: Perlin noise added, along with 'directionality'. Agents now look for the closest food particle.</em></p>\n<p><img src=\"https://salilparekh.work/img/sl-5.png\" alt=\"EyeMyth Poster\" /><br />\n<em><strong>Iteration 3</strong>: Plants (static food) now regenerate, as well cleaning up of agent algorithm.</em></p>\n<p><img src=\"https://salilparekh.work/img/sl-6.png\" alt=\"EyeMyth Poster\" /><br />\n<em><strong>Iteration 4</strong>: Agents can reproduce by finding a mate, only once they have enough food. They switch between roaming, eating or mating.</em></p>\n<p><img src=\"https://salilparekh.work/img/sl-7.png\" alt=\"EyeMyth Poster\" /><br />\n<em><strong>Iteration 5</strong>: Each agent has unique characteristics, with parents passing their genes to their offspring via a rudimentary DNA system. First experiments conducted to check which characteristics survived better.</em></p>\n<p><img src=\"https://salilparekh.work/img/sl-8.png\" alt=\"EyeMyth Poster\" /><br />\n<em><strong>Iteration 6</strong>: Predators added to the ecosystem, with major changes being made to the backend to ensure everything runs smoothly.</em></p>\n<p><img src=\"https://salilparekh.work/img/sl-9.png\" alt=\"EyeMyth Poster\" /><br />\n<em><strong>Iteration 7</strong>: Telemetry overlay added to observe experiments conducted with the system. Visual characteristics added to reflect the agent's actual DNA values.</em></p>\n<p><img src=\"https://salilparekh.work/img/sl-2.png#fullwidth\" alt=\"EyeMyth Poster\" /><br />\n<em>The final version, which includes a control panel to change parameters</em></p>\n<p><img src=\"https://salilparekh.work/img/pondmovie.mp4\" alt=\"EyeMyth Poster\" /><br />\n<em>A short video of one of the experiments. Note: The colours indicate the maximum speed of one type of agent. With every subsequent generation they get faster on average as only the fastest ones end up surviving. (They change from red -&gt; orange -&gt; yellow -&gt; green)</em></p>\n<p>The primary goal of this project, apart from creating a homeostatic system, is to explore alternate systems of survival as an alternative to the traditional predatory, survival of the fittest paradigm. The first step in doing so was to create a traditional ecosystem which would serve as a benchmark. The alternate systems of survival are phrased as questions, and the plan is continue asking questions of an ecosystem,</p>\n<p><strong>Q.</strong> Would a species survive better if it shared resources?</p>\n<p><strong>A.</strong> The answer to this might seem obvious, given that humans, as a species worked together as a community to evolve. However in the context of a simple ecosystem, with simple rules, does this still hold true? There’s no straightforward answer to this question, and in the simulations, the answer is both yes and no. When there is a scarcity of food, or when agents in a space where there isn’t enough food, sharing helps keep entities alive till more food is found. In a situation where there is an abundance of food, sharing can be detrimental, as it prevents the entities from having enough food to find a mate, reproduce and transfer their genes to the next generation.</p>\n<p>This may sound philosophical, but the ecosystem has multiple answers to a question, one just needs to pay attention. The answers are definitely not binary, and the context for the answers does matter.</p>\n<p><strong>Q.</strong> Does it help to look after the environment?</p>\n<p><strong>A.</strong> A relevant question, given that humans are asking themselves the same question and realising that the answer is indeed yes. This is mirrored in the ecosystem as well. Entities can ‘take care’ of the environment by only eating older, mature plants, and leaving the younger plants to mature and reproduce. When entities do not pick and choose which plants they eat, they decimate entire clusters, leaving that particular section completely bare, and as a result any younger entities may not be able to survive till they find another cluster or wait for the plants to grow again. When entities pay attention to what they eat, enough plants in a cluster survive to continue reproducing and sustaining the cluster. Although the entities may not experience the same population explosion they have when they eat everything, in the longer run, they have a steadier growth rate, as compared to alternating highs and lows in the population count.</p>\n<p><span>This ecosystem, or the pond as it’s affectionately known serves a functional test-bed to research and answer questions one might have. It’s also a fun tool to play around with, as changing the values of the various parameters can lead to interesting outcomes. To make the pond accessible, a control panel with various parameter controls was developed. It contains various controls, as well as a reset button, which makes it easy to set parameters, reset and view the outcome without having to recompile and relaunch the Processing code. The pond is essentially an open-ended research tool.</span></p>\n",
      "date_published": "2021-03-02T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/what-does-water-want/",
      "url": "https://salilparekh.work/posts/what-does-water-want/",
      "title": "What Does Water Want?",
      "content_html": "<p>This is a question I’ve never thought of asking myself, surprising considering the fact that water is a critical part of my life. I’ve never thought of water as an entity, as a being. It’s always been a resource for me, a necessity which doesn’t have it’s own autonomy, it’s own wants and needs. Nor have I paid attention to water communicating with me, in its various states and energy levels, or the marks it leaves behind when it interacts with other elements and objects. The ease of access with which water is accessed in many countries also plays a role in diminishing it’s value. The simple and ubiquitous tap, obfuscates the immense resources required to obtain clean water, safe for human consumption. Water has no say in the way that it is treated.</p>\n<blockquote>But what if things were different? What if, in an alternate reality water had some form of autonomy, some say in the relationship between water and humans. What would that world look like? How would things change? How different would it be from our reality?</blockquote>\n<p>This project attempts to explore this speculative reality, and piece together what this world would look like. Although purely speculative, the intent of this project and the resulting visuals is to have the viewer reflect on their relationship with water, and perhaps build a stronger, and more meaningful bond with water.</p>\n<p>The explorations were manifested in various forms, from speculative objects, to magazine spreads.</p>\n<p>Guided by Anthony Dunne and Fiona Raby from <a href=\"https://www.designedrealities.org/\">Designed Realities</a>.</p>\n<p><img src=\"https://salilparekh.work/img/wdww-20.png#fullwidth#imageborder\" alt=\"DR\" /><br />\n<img src=\"https://salilparekh.work/img/wdww-21.png#fullwidth#imageborder\" alt=\"DR\" /><br />\n<em>Notes of a product designer in this speculative reality</em></p>\n<p><img src=\"https://salilparekh.work/img/wdww-22.png#fullwidth#imageborder\" alt=\"DR\" /><br />\n<img src=\"https://salilparekh.work/img/wdww-24.png#fullwidth#imageborder\" alt=\"DR\" /><br />\n<img src=\"https://salilparekh.work/img/wdww-23.png#fullwidth#imageborder\" alt=\"DR\" /></p>\n<p><img src=\"https://salilparekh.work/img/wdww-25.png#fullwidth#imageborder\" alt=\"DR\" /><br />\n<img src=\"https://salilparekh.work/img/wdww-37.png#fullwidth#imageborder\" alt=\"DR\" /><br />\n<img src=\"https://salilparekh.work/img/wdww-27.png#fullwidth#imageborder\" alt=\"DR\" /><br />\n<img src=\"https://salilparekh.work/img/wdww-30.png#fullwidth#imageborder\" alt=\"DR\" /><br />\n<img src=\"https://salilparekh.work/img/wdww-33.png#fullwidth#imageborder\" alt=\"DR\" /><br />\n<img src=\"https://salilparekh.work/img/wdww-34.png#fullwidth#imageborder\" alt=\"DR\" /><br />\n<img src=\"https://salilparekh.work/img/wdww-31.png#fullwidth#imageborder\" alt=\"DR\" /></p>\n<p><img src=\"https://salilparekh.work/img/wdww-35.png#fullwidth#imageborder\" alt=\"DR\" /></p>\n<p><img src=\"https://salilparekh.work/img/wdww-36.png#fullwidth#imageborder\" alt=\"DR\" /></p>\n<p><img src=\"https://salilparekh.work/img/wdww-32.png#fullwidth#imageborder\" alt=\"DR\" /><br />\n<em>Spreads from a home improvement magazine</em></p>\n",
      "date_published": "2021-03-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/economics-of-video-games/",
      "url": "https://salilparekh.work/posts/economics-of-video-games/",
      "title": "Economics of Video Games",
      "content_html": "<p>Economics and gaming are not words one would expect to find in a single sentence, however there are many similarities between these disciplines. Models are an important part of the field of economics. Models are frameworks designed to describe complex systems at work, outline the entities and activities that take place within. They make visible the various components, and the relationships between them. Models are often used to illustrate phenomena that happen in the real world, but can also be used to speculatively describe systems that do not yet exist. Economic models are an attempt to make sense of the real world, and as detailed as they may be, they are unlikely to ever be universal general purpose models.</p>\n<p>If one were to replace the word ‘models’ with ‘games’ in the paragraph above, the text would not still be valid. Games, just like economic models are in essence, created to describe systems, real and fictional. From the simplest games such as ‘Tic-Tac-Toe’, to city scale simulations such as ‘Grand Theft Auto’, they are very much similar to economic models. ‘Tic-Tac-Toe’ and ‘Grand Theft Auto’ are very different from each other, but share the characteristic of modelling the rules of a system which the agents are expected to abide by.</p>\n<p>Game designers use economic models to help them create in-game systems and ensure that the gameplay and experience works as intended. Although the story, or the narrative of a game is core to the game, the economics of a game is just as important to ensure that the overall experience is cohesive. For example, the story may dictate that the player undertake certain tasks, but if the cost of certain actions is too expensive for the player, the immersion might break. Players of a game, just like people in economic models, are looking to get the most value of their investment. Just as people in the real world look to get the most value for their money, players look to get the most value of the time they spend playing the game.</p>\n<p>In the same way that a layperson would conduct research in order to understand their options better and make informed decisions, the average player of a game will read the tutorial, and observe the game world to strategise their next moves. Speedrunners are those players who try to finish a game as fast as possible. A speedrunner is a special kind of player, the one who studies the game extensively, pores over the documentation, browses any available information, in order to complete the game as fast as possible. This is the player who inevitably always manages to get the most value from a game, with as little investment as possible. Just like the economist, who conducts extensive research on various models, various kinds of economic systems, in order to better understand how the world works. Put simple, the speedrunner, like the economist, will be the one who will get closest to the theoretical MU=MC (Marginal Utility = Marginal Cost).</p>\n<p>The world of speedrunning is an intensely competitive one. The landscape is constantly evolving, as record times fall quickly and consistently. Every known game has its own speedrunning community, with the best players competing to find the quickest possible way to complete the game. The speedrunning community is also a rather supportive one, with players learning from each other, and from the larger player base consisting of regular players. The pace of improvement is usually rapid, fueled by the collective learning of the community.</p>\n<p><img src=\"https://salilparekh.work/img/mcsr1.png\" alt=\"Modified screenshot of Republic TV\" /><br />\n<em>Downward trend in times. Data from <a href=\"https://www.speedrun.com/mc\">Speedrun</a> ↗</em></p>\n<p><img src=\"https://salilparekh.work/img/mcsr2.png\" alt=\"Modified screenshot of Republic TV\" /><br />\n<em>Breakthroughs often lead to the community as a whole getting faster. Data from <a href=\"https://www.speedrun.com/mc\">Speedrun</a> ↗</em></p>\n<p>One of the many reasons why speedrunners get quicker over time is the fact that there are usually hundreds of thousands, if not millions of attempts being made to complete the game each month. This rapid, iterative process is key to the search of finding the sweet spot of MU=MC. Players share their successes and failures in public forums, and this information is used to craft optimal strategies. This process of finding the theoretical point of equilibrium can be of incredible value to the discipline of economics.</p>\n<p>Games have not only used economics to help create an immersive experience, but to also manage actual economies. Certain games, such as EVE Online, or a network of games, like the games created by Valve. Some virtual economies are even stronger than ones in real life. For a while, the economy of EverQuest was stronger than Russia’s. Economists hired by game developers oversee the sprawling economies and ensure that everything runs smoothly. Inflation, deflation and even recessions can occur in these worlds. Economists also ensure that content created by the developers is consumed by the players over a period of time, ensuring that players don’t get bored, and that developers have ample time to continue generating new content. Yanis Varoufakis, hired by Valve recently stated “Economic theory has come to a dead end — the last real breakthroughs were in the 1960s. But that’s not because we stopped being clever. We came up against a hard barrier. The future is going to be in experimentation and simulation — and video game communities give us a chance to do all that.”</p>\n<p>In a now deleted blogpost, Varoufakis states that it would be possible to run through speculative scenarios, such as studying whether the U.S. would have rebounded without the New Deal in 1932 using game-based simulations. He called the digital economy “An economist’s paradise.”</p>\n<p>The near unlimited potential of games and possibilities of a digital economy could help unlock new economic systems. Researchers have already started exploring new taxation systems using machine learning models and simulations. As useful as it is to use machine learning, it is not the same as having real people participate. It is impossible to test new economic models in the real world, and so digital platforms offer a very interesting opportunity. Games, played by real people make for a very interesting proposition for economists looking to experiment with new economic models. This is of course not a novel idea, but a one that the field of economics is yet to fully embrace. Players around the world participate in such experiments everyday, and have been doing so ever since multiplayer games were introduced. A brief scan of servers in popular multiplayer games such as Minecraft, or Roblox will serve as testament to the incredible diversity of systems already being experimented with. There is much to learn at the intersection of games and economics. Speedrunners and economists have similar goals, with plenty to learn from each other.</p>\n<h4 id=\"reference\" tabindex=\"-1\">Reference <a class=\"direct-link\" href=\"https://salilparekh.work/posts/economics-of-video-games/#reference\" aria-hidden=\"true\">#</a></h4>\n<p>Maz, Alice. “Playing to Win” Alice Maz, 2017, <a href=\"http://alicemaz.com/writing/minecraft.html\">http://alicemaz.com/writing/minecraft.html</a> ↗. Accessed 3 June 2021.</p>\n<p>Plumer, Brad. “The economics of video games.” Washington post, 2012, <a href=\"https://www.washingtonpost.com/news/wonk/wp/2012/09/28/the-economics-of-video-games/\">https://www.washingtonpost.com/news/wonk/wp/2012/09/28/the-economics-of-video-games/</a> ↗. Accessed 20 July 2021.</p>\n<p>Rodrik, Dani. Economics Rules: Why Economics Works, When It Fails, and How To Tell The Difference. New York: W.W. Norton, 2015.</p>\n<p>Varoufakis, Yanis. “It All Began With A Strange Email.” Valve Software, Valve Software, <a href=\"http://blogs.valvesoftware.com/economics/it-all-began-with-a-strange-email/%20\">http://blogs.valvesoftware.com/economics/it-all-began-with-a-strange-email/ </a> ↗. Accessed 23 July 2021.</p>\n",
      "date_published": "2021-02-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/i-have-nothing-to-hide/",
      "url": "https://salilparekh.work/posts/i-have-nothing-to-hide/",
      "title": "I Have Nothing to Hide",
      "content_html": "<p>India’s national digital biometric identity system, the Aadhaar was introduced in 2009 by the UIDAI (Unique Identification Authority of India). The Aadhaar is a 12-digit unique identity number, which contains demographic and biometric data of the holder. Manifested in the form of a printed card which contains the holder’s basic information, the Aadhaar number, and a QR code make it easily accessible to an electronic terminal. The intent of the Aadhaar was to create a single unique identifier which the holder could use to confirm their identity to avail of services, instead of having to rely on a bevy of identification documents such as birth certificates and utility bills, amongst others. It is required to access government welfare schemes, such as unemployment benefits, distribution of subsidised LPG (Liquefied petroleum gas), and the MNREGA (Mahatma Gandhi National Rural Employment Guarantee Act) which guarantees at least 100 days of wage employment in a financial year. Private companies started to use Aadhaar as proof of identity, since it was quicker to do so as compared to verifying multiple documents. The Aadhaar API enabled easy identification using a fingerprint scanner to match biometric data. State governments also started mandating the use of Aadhaar to avail of various government services.</p>\n<p>The implementation of Aadhaar was not without its challenges. Many found it difficult to obtain an Aadhaar ID, either due to technical difficulties associated with the biometric scanners, or the lack of certain identification documents. There were widespread issues reported while registering for an Aadhaar ID, with many holders having incorrect information recorded, having to pay bribes to register, failure in authentication, amongst many others. In many cases, the lack of an Aadhaar ID led to the inability of many to access crucial government welfare schemes and rations. The exclusion of citizens from welfare schemes due to the lack of an Aadhaar ID led the Supreme Court to issue an interim order in 2013, which stipulated that the government cannot deny a service to a resident who does not possess Aadhaar, as it is voluntary and not mandatory. However, in 2016, the BJP majority led government passed the Aadhaar Bill, which mandated the use of Aadhaar to access government subsidies. Soon, the Aadhaar was mandatory for mobile connections, opening bank accounts, availing of LPG subsidies, scholarships and higher education fellowships, crop insurance, income tax returns, vehicle registrations, death certificates, post office deposits, rations, and for any transactions over Rs. 50,000. In a 2018 judgment, the Supreme Court stated that the Aadhaar is not mandatory for opening bank accounts, getting a mobile number, or being admitted to a school.</p>\n<p>Aadhar continued to be plagued by issues, with a reporter from The Tribune having successfully bought credentials to access the <a href=\"https://www.tribuneindia.com/news/archive/nation/rs-500-10-minutes-and-you-have-access-to-billion-aadhaar-details-523361\">Aadhaar database for ₹ 500</a>. However, the UIDAI dismissed the report, and insisted on the security of the database and the system, and even filed an FIR (First Information Report) against <a href=\"https://www.deccanherald.com/content/652335/fir-filed-against-tribune-over.html\">The Tribune</a>. A Twitter user with the handle, @fs0c131y investigated the official Aadhaar app called mAadhaar, on Android and found a security flaw which could allow malicious entities to <a href=\"https://www.deccanherald.com/content/653312/twitter-user-chips-away-maadhaar.html\">steal the users Aadhaar data</a>.</p>\n<p>The Supreme Court judgement from 2018 is particularly interesting, as it stated that the right to privacy cannot be impinged without a just, fair and reasonable law. For starters, the ruling disallowed the use of Aadhaar by private entities for establishing the identity of the individual. The ruling also clarified a proportionality test, which was required in order for the mandatory linking of Aadhaar to any services. The proportionality test has four conditions. There must be a <u>Legitimate Goal</u>, a <u>Rational Connection</u> (suitable means of furthering the goal), a <u>Necessity</u> (There must not be any less but equally effective alternative), and a <u>Balancing</u> (It must not have a disproportionate impact on the right holder). This was a landmark ruling, which was important in checking the rampant use of Aadhaar.</p>\n<p>The intention with Aadhaar was to create a single identification system, in order to simplify the distribution of government welfare and subsidies. An explicit aim of Aadhar was to make the PDS (Public Distribution System)-the mainstay of India's food programs-more efficient and easily accessible to beneficiaries. In 2011, the United Progressive Alliance led government conducted India’s first caste-based census since 1931. Called the Socio-Economic Caste Census (SECC-2011), it was a study of socio-economic status of rural and urban households which collected data on caste and income of every Indian citizen and was coordinated by the Ministry of Rural Development of India. The study was conducted in order to get a more nuanced understanding of poverty and identification of beneficiaries of social welfare schemes. In 2017, the Central Government used the findings of the SECC as the main instrument of identifying beneficiaries, instead of the poverty line. This helped the government rollout schemes which focussed on indicators other than family income, such as assistance for building houses, pensions, skill training, providing business loans, amongst others.</p>\n<p>In 2015, The Ministry of Rural Development (MoRD) of India proposed the creation of a continuously updating social registry to augment the existing SECC-2011 data with the intention of identifying beneficiaries eligible for government welfare schemes. Detailed in an investigative report by <a href=\"https://www.huffpost.com/archive/in/entry/aadhaar-national-social-registry-database-modi_in_5e6f4d3cc5b6dda30fcd3462\">Huffpost India in 2020</a>, this would allow the government to identify eligible citizens far quicker as compared to waiting for another census to update their registry. Additionally, this would also identify citizens no longer eligible, thus making the welfare distribution system far more efficient. The benefits of such a system would especially be noticeable in the event of a crisis, such as a natural disaster, or a pandemic. A continuously updating registry would also enable the tracking of beneficiaries across rural and urban areas, and disburse the corresponding welfare as applicable. The proposal suggested the creation of a centralised database, which relied on Aadhaar linked data to track the eligibility status of every citizen. Subsequently, this proposal has undergone years of development, with various organizations, including the UIDAI, MoRD, and the World Bank working on it. Tentatively called the National Social Registry, it is also known as the Social Registry Information System, and the SECC Social Registry.</p>\n<p>The National Social Registry (NSR) will be created using multiple datasets linked by the Aadhaar ID. This will enable the NSR to collect any kind of data attached to an Aadhaar number. This would include information on banking, mobile SIM cards, higher education, scholarships, property, income, employment, and much more. The Huffpost report states that the government intends to have the database operational by 2021. In order to access the Aadhaar linked data without running afoul of the Supreme Court judgement of 2018, UIDAI has suggested amendments to the 2016 Aadhaar Authentication Act, which would bypass the 2018 judgement. In particular, the proposed changes would amend specific regulation concerning using identity information only for the purpose specified during authentication, and the sharing of authentication logs with any other person other than the Aadhaar number holder.</p>\n<p>These changes would not only be detrimental to the privacy of the Aadhaar number holder as it enables the sharing of information to third parties whenever the Aadhaar is used for authentication, but also enable the collection of data for the National Social Registry. Consent received by the Aadhaar number holder for one purpose would then be considered consent for other uses, and with other government agencies.</p>\n<p>However, it could be argued that the blanket consent wouldn’t pass the proportionality test defined by the Supreme Court in the 2018 ruling. The assumption of consent would contravene the requirement of a Legitimate Goal and the sharing of information wouldn't meet Rational Connection (suitable means of furthering the goal). Additional changes by government organizations and think tanks propose the addition of the family tree to the database, as well as linkages to birth, death, and marriage registers in order to account for migration. In 2018, Prime Minister Modi approved the proposal to update the SECC, paving the way for creation for the National Social Registry.</p>\n<p>The concept of a social registry isn’t a novel one, with many countries around the world having implemented versions of it, with the United States’s Social Security Number being a good example. It is interesting to note however, that the US’s SSN does not contain biometrics, and is generally not shared except for confidential transactions. It is considered to be highly sensitive information and the most protected personally identifying information. The creation of a social registry such as the proposed NSR needs to be counterbalanced with strong personal data protection rights, which gives the citizen informed choice in how their data is used. The NSR is not dissimilar to the Indian Census, however it does not have the legal protection of the census which mandates the confidentiality of those enumerated. In fact, the SECC-2011 also does not have these protections either.</p>\n<p>The goal of the NSR is to identify citizens eligible for government welfare schemes, and as such should only contain the <a href=\"https://indianexpress.com/article/opinion/columns/covid-19-welfare-schemes-aadhaar-pm-cares-7071075/\">appropriate amount of data to meet the goal</a>. The proposed changes to the Aadhaar Authentication Act also hint at an approach which has little to no regard to the privacy of the Aadhaar card holders. Although it is expected that the government will use the NSR for its intended purpose, it is not yet known whether other government agencies, such as law enforcement will be granted access as well. The proposed changes to Aadhaar Authentication Act which assume blanket consent for any third party government agency to use the data would make it feasible for this to happen. A dataset of this magnitude can also be used in conjunction with machine learning algorithms to profile citizens. Manoranjan Kumar, the then Economic Advisor to the Ministry of Rural Development in 2015, was the author of the note which led to the proposal to create the NSR. He has expressed concern that this database could be misused by the government. In a note obtained by Huffpost India, he proposed increased privacy safeguards for the registry as he was worried about <a href=\"https://www.huffpost.com/archive/in/entry/modi-govt-tracking-database-police-state-fears_in_5e70cb5ec5b6eab7793ca8f5\">“the policing system and bureaucracy that is not hesitating to show crumbling morality”</a>.</p>\n<p>There certainly is precedent for social registries created for the express purpose of helping to disburse government welfare being used by law enforcement agencies. Telangana conducted the Integrated Household Survey in 2014, which was similar in nature to the SECC-2011, with the intention of collecting nuanced demographic and socio-economic data of every resident of the state. The results of this survey were subsequently used to create a social registry system, without the use of Aadhaar as a single identifier. Called the <a href=\"https://www.huffpost.com/archive/in/entry/telangana-samagram-system-social-registry_in_5e721e19c5b63c3b64881b30\">Samagra Vedika</a>, it combines data from various databases to create a profile on every citizen. Heavily inspired by the X-Road of Estonia, this system is accessible by law enforcement agencies, in spite of it being created specifically for the purpose of poverty alleviation. In a demo shown to HuffPost India, the Samagra Vedika was able to showcase connections to any given person through family, residential location, and contact information. The system can pull up information on address, phone number, high school and higher secondary exam details, passport and driving licence information and vehicle ownership details for any given citizen. The Principal Secretary of Telangana’s Department of IT claimed that they can track down a person’s digital footprint with 96% accuracy with simply a name. The system did not require the consent of citizens, since it only collates data from existing state records and government agencies, and does not need to collect any fresh data. Since it does not use the Aadhaar, it is exempt from the 2018 Supreme Court ruling on the Aadhaar Act. The Samagra Vedika also uses machine learning algorithms to search through the data and effectively identify a person’s identity. Machine learning algorithms learn from the datasets they use, with the potential of reinforcing existing biases and behaviours.</p>\n<p>The lack of transparency around the proposed National Social Registry and the Samagra Vedika is very worrying. It’s only through excellent investigative reporting, and multiple RTI (Right to Information Act) requests by Huffpost India that we are able to know of the existence of such registries and their workings. The asymmetry of power between the state and the citizens is also concerning, with a lack of data protection rights and the poor data security of the government.</p>\n<p>The response to these systems is a mixed bag. Scrolling through internet forums like Reddit reveals most people are uncomfortable with the development of the NSR, and even in conversations with friends and peers, the response is mostly negative. However, there are a small number of people who are quite supportive of the NSR and similar systems. A response that I’ve seen across forums, both online and offline, is “I have nothing to hide, so why should it matter to me?” Another common rhetoric I’ve seen is “Unless you are anti-social, why should you be worried?” Citing the Social Security system in the United States, and the benefits it brings, the proponents of an all-encompassing social registry feel that such a system is necessary for progress.</p>\n<p>The potential misuse of a social registry by the Indian government may not be immediately apparent, but there is a precedent for large, all-encompassing datasets to be abused. In 2019, a private technology company IT Grids Pvt. Ltd. was found to be in possession of <a href=\"https://www.huffpost.com/archive/in/entry/hacking-democracy-stolen-aadhaar-voter-deletion_in_5cb9afa2e4b068d795cb870c\">7,82,21,397 Aadhaar numbers from Telangana in a particular structured format</a>. This is in addition to 2,00,00,000 Aadhaar numbers from Punjab. The police believe that the data was being used by the company to map voters with beneficiaries of various government schemes and results of surveys conducted by the government. The origin of the data is yet to be determined, but the structure of the dataset is a replica of the format used in the SRDH (State Resident Data Hubs) and CIDR (UIDAI’s Central Identities Data Repository). UIDAI has denied reports of any data breach.</p>\n<p>IT Grids is also the developer of the Seva Mitra app, created by the TDP (Telugu Desam Party), the ruling party for its cadres to interact with the party leaders. It is alleged that the cadres used the Aadhaar database to profile voters using an automated IVRS (Interactive Voice Response System), which would ask the Aadhaar card holder a few questions, based on which they created a list of people who weren’t likely to vote for them. The TDP cadres then filed Form 7 (Form 7 is an objection to a name being included in the voter list which can be filed by anyone about anyone else) requests to have them removed from the voter rolls. The matter is still under investigation, and the data recovered from the hard drives raided from IT Grids are still under forensic analysis.</p>\n<p>The National Social Registry in it’s proposed form will hold a lot more data about Indian citizens than it requires to efficiently identify eligible candidates for government welfare schemes. The lack of transparency in the creation of this registry, and it’s usage is very concerning as well. An absence of personal data protection rights and the inability for courts to rule on data related matters gives the state disproportionate powers, and this power imbalance must be corrected. The NSR is a powerful tool, and in the hands of law enforcement can be used as a tool of mass surveillance, keeping track of all activities. You may not have anything to hide today, but perhaps in the future your activities, or your identity could make you a target. We’ve seen the targeting of voters in Telangana, and further allegations of the same were seen in Puducherry. The NSR is a tool, but if used with malicious intent can be used as a weapon.</p>\n<h4 id=\"references\" tabindex=\"-1\">References <a class=\"direct-link\" href=\"https://salilparekh.work/posts/i-have-nothing-to-hide/#references\" aria-hidden=\"true\">#</a></h4>\n<ul>\n<li><a href=\"https://www.huffpost.com/archive/in/entry/aadhaar-national-social-registry-database-modi_in_5e6f4d3cc5b6dda30fcd3462\">https://www.huffpost.com/archive/in/entry/aadhaar-national-social-registry-database-modi_in_5e6f4d3cc5b6dda30fcd3462</a></li>\n<li><a href=\"https://www.mondaq.com/india/privacy-protection/744522/the-supreme-court39s-aadhaar-judgement-and-the-right-to-privacy\">https://www.mondaq.com/india/privacy-protection/744522/the-supreme-court39s-aadhaar-judgement-and-the-right-to-privacy</a></li>\n<li><a href=\"https://www.deccanherald.com/content/79895/uidai-plans-use-aadhaar-number.html\">https://www.deccanherald.com/content/79895/uidai-plans-use-aadhaar-number.html</a></li>\n<li><a href=\"https://www.thehindu.com/news/cities/Hyderabad/it-grids-also-accessed-data-relating-to-other-states-sit/article26858513.ece\">https://www.thehindu.com/news/cities/Hyderabad/it-grids-also-accessed-data-relating-to-other-states-sit/article26858513.ece</a></li>\n<li><a href=\"https://www.thenewsminute.com/article/explained-it-grids-case-and-fight-between-ap-and-telangana-government-97800\">https://www.thenewsminute.com/article/explained-it-grids-case-and-fight-between-ap-and-telangana-government-97800</a></li>\n<li><a href=\"http://164.100.47.4/BillsTexts/LSBillTexts/Asintroduced/373_2019_LS_Eng.pdf\">http://164.100.47.4/BillsTexts/LSBillTexts/Asintroduced/373_2019_LS_Eng.pdf</a></li>\n<li><a href=\"https://uidai.gov.in/images/targeted_delivery_of_financial_and_other_subsidies_benefits_and_services_13072016.pdf\">https://uidai.gov.in/images/targeted_delivery_of_financial_and_other_subsidies_benefits_and_services_13072016.pdf</a></li>\n<li><a href=\"https://uidai.gov.in/images/regulation_1_to_5_15092016.pdf\">https://uidai.gov.in/images/regulation_1_to_5_15092016.pdf</a></li>\n<li><a href=\"https://indianexpress.com/article/opinion/columns/covid-19-welfare-schemes-aadhaar-pm-cares-7071075/\">https://indianexpress.com/article/opinion/columns/covid-19-welfare-schemes-aadhaar-pm-cares-7071075/</a></li>\n<li><a href=\"https://www.livemint.com/Politics/UgblAmPPHetk71sjQUqcvN/Aadhaar-bill-passed-in-Lok-Sabha-the-story-so-far.html\">https://www.livemint.com/Politics/UgblAmPPHetk71sjQUqcvN/Aadhaar-bill-passed-in-Lok-Sabha-the-story-so-far.html</a></li>\n<li><a href=\"https://economictimes.indiatimes.com/news/politics-and-nation/parliament-passes-aadhaar-amendment-bill/articleshow/70130501.cms?from=mdr\">https://economictimes.indiatimes.com/news/politics-and-nation/parliament-passes-aadhaar-amendment-bill/articleshow/70130501.cms?from=mdr</a></li>\n<li><a href=\"https://www.newsclick.in/Telangana-Aadhaar-Data-2-Crore-Punjab-Residents-Seized-IT-Company\">https://www.newsclick.in/Telangana-Aadhaar-Data-2-Crore-Punjab-Residents-Seized-IT-Company</a></li>\n<li><a href=\"https://www.epw.in/engage/article/aadhaar-failures-food-services-welfare\">https://www.epw.in/engage/article/aadhaar-failures-food-services-welfare</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Aadhaar\">https://en.wikipedia.org/wiki/Aadhaar</a></li>\n<li><a href=\"https://www.financialexpress.com/aadhaar-card/threat-of-aadhaar-misuse-when-cambridge-analytica-data-leak-controversy-found-a-mention-in-supreme-court/1136484/\">https://www.financialexpress.com/aadhaar-card/threat-of-aadhaar-misuse-when-cambridge-analytica-data-leak-controversy-found-a-mention-in-supreme-court/1136484/</a></li>\n<li><a href=\"https://www.financialexpress.com/india-news/aadhaar-data-leak-indias-nightmare-potential-of-large-scale-misuse-of-aadhaar-data-is-real/1551450/\">https://www.financialexpress.com/india-news/aadhaar-data-leak-indias-nightmare-potential-of-large-scale-misuse-of-aadhaar-data-is-real/1551450/</a></li>\n<li><a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5741784/\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5741784/</a></li>\n</ul>\n",
      "date_published": "2021-01-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/pixelcryption/",
      "url": "https://salilparekh.work/posts/pixelcryption/",
      "title": "Pixelcryption",
      "content_html": "<p>Steganography is the technique of hiding messages within plain sight. The message is usually encrypted within something ordinary to avoid detection, and is decoded by the receiver with a special set of instructions. The messages themselves are usually codified for an additional layer of security. An example of steganography is the use of invisible ink, which is used to write messages on a piece of paper which is then overlaid with a standard innocuous message in real ink. Upon exposure to heat, the hidden message is revealed.</p>\n<p>According to the UK based research firm <a href=\"https://www.comparitech.com/blog/vpn-privacy/surveillance-states/\">Comparitech</a> ↗, India ranks third on a list of surveillance states, closely following Russia and China. This government has also passed the Unlawful Activities Prevention Act (UAPA), which allows for the arrest of anyone on mere suspicion, and without any proof or evidence. This law has been used with impunity on the leaders of the protest against the Citizenship Amendment Act and on other political opponents.</p>\n<p>India currently has no data protection laws in place, and there isn't a data protection authority in place. The government has also been accused of using an Israeli software called Pegasus to illegally obtain Whatsapp chats from Indian citizens. Although this claim has been denied, they are working with Whatsapp to track certain messages. A Social Media Communication Hub (SMCH) is being set up to collect and analyse content of social media profiles. There are concerns that the purpose of the SMCH is to <a href=\"https://www.financialexpress.com/india-news/does-government-want-to-tap-whatsapp-messages-create-a-surveillance-state-asks-supreme-court/1243924/\">&quot;create a technology platform to collect digital media chatter from all core Social Media Platforms as well as digital platforms.&quot;</a> ↗</p>\n<p><img src=\"https://salilparekh.work/img/pixelcryption-4.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>A Times Now presenter perceiving &quot;Imma Bounce&quot; from leaked Whatsapp chats to be an indication of financial fraud. Source: <a href=\"https://www.thequint.com/neon/social-buzz/times-now-rhea-chakraborty-messages-sushant-singh-rajput-iamma-bounce\">The Quint</a> ↗</em></p>\n<p>There is a need for a secure, yet easily accessible steganographic system which can leverage existing networks to communicate and share information without detection from the government.</p>\n<p>Whatsapp is the most widely used messaging app in India, with about 400 million users as of 2019. A popular method of keeping in touch with each other and larger groups is with the help of 'Good Morning messages', in the form of both images and text. The images usually contain a cheery message with colourful visuals of flowers, babies, mountains, and lakes. These messages are sent so frequently that they are often the cause of many phones filling up their memory. On the eve of 2018, users in India sent about 20 billion messages, causing slowdowns and server outages.</p>\n<p><img src=\"https://salilparekh.work/img/pixelcryption-2.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>A standard 'good morning' message</em></p>\n<p>Although usually innocuous, some messages contain xenophobic, casteist, and sexist content. These images are forwarded hundreds of times, causing them to be shared exponentially. Some of these Whatsapp forwards and messages have incited mob lynchings which have led to deaths of several innocent people. To combat the spread of misinformation, Whatsapp has imposed limits on the number of message forwards.</p>\n<p><img src=\"https://salilparekh.work/img/pixelcryption-1.jpeg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Example of fake news widely shared across Whatsapp</em></p>\n<p>In an effort to subvert the medium of good morning messages on Whatsapp, the Instagram account @sodonechilling (now defunct) collects and creates good morning messages with positive and socially aware messaging, using the same aesthetic and visual look. People often don't read or scrutinise the content of the images they share and forward, which makes this medium a great way to share positive messaging.</p>\n<p><img src=\"https://salilparekh.work/img/pixelcryption-3.jpeg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>An image from @sodonechilling's Instagram page</em></p>\n<h2 id=\"pixel-based-encryption\" tabindex=\"-1\">Pixel Based Encryption <a class=\"direct-link\" href=\"https://salilparekh.work/posts/pixelcryption/#pixel-based-encryption\" aria-hidden=\"true\">#</a></h2>\n<p>Hiding messages within the source code of image files is a commonly used technique, and as such would be detected with easily accessible software and decryption algorithms. This method involves editing the bits of an image to encrypt messages, with minimal change to the image itself.</p>\n<p>I took a simpler approach toward this problem, and decided to use the pixels themselves as a way to encode messages. Each pixel has 3 channels—Red, Green, and Blue–each with a capacity of 256 (0-255) spaces. By assigning the value of each space, or a combination of spaces to a particular character, data can be stored. Although this will lead to a change in colour of the pixels of the image, the colour channels can be adjusted for each image to ensure that there are minimal changes in the visual. Most images shared on Whatsapp are usually of poor quality, with plenty of artefacts such as colour shifting and fringing. The length of the message and the complexity of encryption can also be adjusted to ensure that the changes made are minimal.</p>\n<p>The pixels on the outer edges of the image are usually not as prominently seen, and are ideal spaces to edit pixels and encrypt information. Additional layers of encryption can also be added by using multiple channels to encrypt characters, which can be further encrypted to hide the real message.</p>\n<p>The encryption and decryption process is very simple. Upload the image, type in your message, and hit the encrypt button to download. Similarly, to decrypt, upload the image and hit the decrypt button to see the message. The length of the message and the contents of the cipher can be adjusted within the code, and potentially be shared as a key to decrypt the base message, which itself can be further encrypted for increased security.</p>\n<iframe width=\"605\" height=\"605\" src=\"https://burnedsap.github.io/pixelcryption/v1/\">\"</iframe>\n<p><em>Try encrypting an image for yourself!</em></p>\n",
      "date_published": "2020-10-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/aesthetics-politics/",
      "url": "https://salilparekh.work/posts/aesthetics-politics/",
      "title": "Aesthetics/Politics of Republic TV and the Toyota AE86 Trueno",
      "content_html": "<h3 id=\"republic-tv\" tabindex=\"-1\">Republic TV <a class=\"direct-link\" href=\"https://salilparekh.work/posts/aesthetics-politics/#republic-tv\" aria-hidden=\"true\">#</a></h3>\n<p>A few months ago, in June 2020, a very popular Bollywood film actor, Sushant Singh Rajput died by suicide in his flat in Mumbai, most likely due to severe depression. It’s a tragic tale for someone who came from a middle class background, and made it all the way to the upper echelons of the film industry. Although he was widely revered, his death stirred up a frenzy not seen before. Right in the middle of the pandemic, with a lockdown in place, large parts of India erupted in anger, demanding justice and accountability. This outrage was largely driven by television news channels, chief among them Republic TV Network and Times Now. They capitalised on the death of Sushant, performing ‘sting’ operations, harassing his friends and flatmates, and creating content which fed the anger and disbelief. For a few months, it was impossible to escape the media blitz. There was barely any mention of the pandemic, the government response, the crumbling economy, or the unemployment. News ceased to exist on the television, with news and media outlets riding the wave of outrage to better ratings and increased viewership.</p>\n<p>Social media was dominated by this news cycle, which was kept alive by alleged witnesses, testimonials, commentators, and further incited by news anchors. The government supported this news onslaught by using state machinery and judiciary to assist with the investigation of the case, in an attempt to find a perpetrator where there was none. After all was said and done, Sushant’s girlfriend was sent to jail for possession of ~50gm of marijuana. Republic TV and Times Now continued to fuel the fury by attempting to indict other Bollywood actors in a so-called drug ring. The government duly obliged, by calling in the named actors in for interrogation, no doubt pleased with the diversion of attention.</p>\n<p>All through this, people who were in search of justice, who identified themselves as SSRWarriors, became ardent supporters of Republic TV, and their brash editor-in-chief and ranchor, Arnab Goswamy. Arnab was their hero, the only person who saw the ‘truth’, and the one who dared fight for justice when no else would. His distinct style of aggressively shouting on screen, and interrogating guests on his channel become a trademark. Arnab became more than a news anchor, he was a messiah. Everything he said was accepted as the truth, and the SSR Warriors followed what he did. On social media, screenshots of Arnab in action at Republic TV were shared widely, providing a kind of legitimacy to the issue. Republic TV uses large, bold text which takes up more than a fifth of the screen space, often with hashtags, or strongly phrased questions. It was screenshot gold, as it was easily readable, and very simple, crude even. Arnab and Republic TV made it okay to believe so strongly, and participate in this ‘media trial.’ A prime-time news show on TV broadcasting about a single topic 24x7, for months on end is a powerful propaganda tool, and it was a brutally effective distraction from the real issues at hand. The government responding directly to the prompts from Arnab only further cemented the belief that there was justice to be found, and that this was all very real.</p>\n<p>I’ve been curious about this phenomenon, and I’ve been thinking about different methods to subvert this movement to bring to light the real issues plaguing India. I created a conflict mapping tool, but I wanted to hijack the medium of sharing screenshots of TV news on social media, and use those images in an attempt to bring to attention the more pressing issues. I downloaded a screenshot of Republic TV, and edited it to make it appear as if Arnab was investigating the PM CARES fund. The PM CARES fund was created by Narendra Modi, the prime minister of India, which collected funds from people and companies alike to fund the response to the COVID-19 pandemic. However, very little is known about the fund, and how it is being used. Repeated RTI requests reveal that it is not a government fund and hence details cannot be revealed, in spite of it being conceptualized by the prime minister.</p>\n<p><img src=\"https://salilparekh.work/img/aesthetics-politics-1.png\" alt=\"Modified screenshot of Republic TV\" /><br />\n<em>Edited screenshot of Republic TV</em></p>\n<p>It would be remiss of me to point out that Arnab was a cog in the larger scheme of things, directing the distraction. But now he finds himself at the mercy of the very monster he created. Unfortunately, the irony of this is lost on his zealous followers.</p>\n<h3 id=\"toyota-ae86-trueno\" tabindex=\"-1\">Toyota AE86 Trueno <a class=\"direct-link\" href=\"https://salilparekh.work/posts/aesthetics-politics/#toyota-ae86-trueno\" aria-hidden=\"true\">#</a></h3>\n<p>When thinking about craft, I usually tend to focus on creative crafts, often with outputs and tangible results. But there also exists crafts, which we don’t usually consider to be a craft. The craft of driving is one of them. One may drive for thousands, or even millions of hours, yet have nothing to show for it. Most of us aren’t even that good at driving, even after spending so much time performing the activity. Is driving even a craft? There are some parallels between driving and traditional crafts, such as painting or pottery. Both are usually learnt through apprenticeship, and take time to master. The masters of the craft usually go on to make a living from their craft (bus drivers, racing drivers, ceramic designers, potters). Whereas potters usually have something to show for their time and efforts, the activity of driving produces nothing, except perhaps for safer travel, and a lower likelihood of being involved in an incident. I often think about the skills one acquires over years of driving a car, and how it remains unrecognised. We don’t appreciate our own craft of driving since it isn’t considered to be a craft as such.</p>\n<p>The rise of fan culture has given rise to many new kinds of mediums, one of them being fancams. Originating from the k-pop fan culture, this short, and fast paced video format usually focuses on a single character, using videos and images with filter overlays. Fancams help with the stanning of a single member from a group, and draws attention to their talents. This particular fancam of an EXID performance catapulted the group into fame, helping revive their flagging career. I’m fascinated by the fancam culture, and so I created a fancam of….driving. I used an old video game which has normal looking cars, and normal looking city maps to create the video, and used a few filters to enhance certain sections of the clip to create a fancam of driving. Fancam making is an entire craft unto itself, and it’s interesting to see different variations of the medium.</p>\n<p>I’ve also been thinking about how certain crafts such as hand drawn artwork and animation are being fetishised and used as a tactic to communicate certain messaging to make it more believable or legitimate. This can be seen in the branding of certain activities of large corporations looking to get buy-in from the community, or push across a certain altered image of themselves. In a strange and twisted way, I see a fancam of driving around as a response to the exoticisation of certain mediums and forms of craft.</p>\n<video controls=\"true\" allowfullscreen=\"true\">\n   <source src=\"https://salilparekh.work/img/aesthetics-politics-2.mp4\" type=\"video/mp4\" />\n </video>\n<p>(The video contains certain elements which are well known in the automotive world. The car is a Toyota AE86, which shot to stardom as the main character of the anime ‘Initial D’. The environment, or piece of road the car drives on is a replica of the Monaco Grand Prix, a popular Formula 1 race track. A commentary on the exoticisation of other crafts by using exoticised elements from the automotive world.)</p>\n",
      "date_published": "2020-09-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/museum-of-salil/",
      "url": "https://salilparekh.work/posts/museum-of-salil/",
      "title": "Museum of Salil",
      "content_html": "<p>Games are objectively a wonderful medium, and video games especially are a great way to tell stories. The interactivity, and immersiveness make it a compelling method to communicate narratives, and I was very excited, and nervous about making a game. In the past I have used Unity, although primarily as an interactive 3D viewing tool, using camera controller prefabs. The programming component of Unity is immensely frightening, and I've seen enough to know how complex game programming can get. So, I approached this project with a fair bit of nervous energy, although still very excited to finally create a game of my own.</p>\n<p>After much work, and even more to work on, I present, Museum of Salil! This is an autobiographical game which lets players get to know me as they wander through the museum. Play the game to find out more!</p>\n<iframe width=\"400px\" height=\"500px\" src=\"https://burnedsap.github.io/bitmap-game/\"></iframe>\n<p><em>Play the game here!</em></p>\n<p>One of my favourite games of all time is Pokémon Emerald, and it's a game I still play to this very day in fact. Over time, I've come to notice and appreciate the narrative, the gameplay, the various gamification methods, and the complex Pokémon mechanisms. Everytime I play the game, I notice another element about it that I really enjoy. I don't think I've found a game in the last 16 years which has dethroned Emerald as my favourite game. Portal 2 comes close, and so does The Stanley Parable. A common thread running across all three of these games is the slow unravelling of the story with time and progress. These games don't reveal the context and the story entirely, but instead, allow you to slowly discover whats happening as you progress through the game and speak to the characters. I really enjoy this style of gameplay and narrative and wanted imbibe the same characteristics within my game as well.</p>\n<p>As for the autobiographical part, it was only right that I choose a museum as a medium through which to tell my story. Not only does it a great way to tell a story through a space, layer by layer, room by room, it also makes sense considering the fact that I studied Exhibition Design, and learnt how to tell stories through spaces. I thought of creating multiple rooms, each of which would reveal a little bit about me. Akin to postmodernist storytelling a la Attempts on Her Life, each room, or story would be disconnected from each other, yet still be about a common topic: me. I also thought it'll be funny to create a museum about myself, a shrine to my ego. Although I do sincerely create this as a storytelling technique, there's no smoke without fire.</p>\n<p>With the non-linear storytelling technique I didn't have a storyboard, and so I worked on figuring out the ideal configuration of the space, which would work well both technically and visually.</p>\n<h3 id=\"development\" tabindex=\"-1\">Development <a class=\"direct-link\" href=\"https://salilparekh.work/posts/museum-of-salil/#development\" aria-hidden=\"true\">#</a></h3>\n<p>Before I had written a line of code, or drawn any art, I knew I wanted to create a pixel art based game, as a homage to Pokémon Emerald. To whitebox the game, I created a 3-frame character sprite, and quickly sketched out the different scenes, using lines and words drawn across the screen. I would use these assets till I had the basic code down, and then work on swapping out these assets for something more substantial.</p>\n<p><img src=\"https://salilparekh.work/img/museum-of-salil-1.png\" alt=\"Modified screenshot of Republic TV\" /><br />\n<em>Whiteboxing to test gameplay</em></p>\n<p>The initial challenge I faced was rendering and controlling the main character. I knew that I'd need to animate the main character controlled by the player, which would need to bump into other objects and trigger conversations. For this I needed to build out functionality which would cycle through sprites, and recognise collisions. I used the p5 play library which allowed me integrate these functions quickly. Ideally I'd have liked to have only used p5js, and nothing more, but time was short and I couldn't find other easy alternatives.</p>\n<p><img src=\"https://salilparekh.work/img/museum-of-salil-2.png\" alt=\"Modified screenshot of Republic TV\" /><br />\n<em>Testing pixel-art architecture</em></p>\n<p>After a few iterations, I had the basic functions figured out with the character moving across the screen with the sprite animations, colliding into NPC's and triggering a dialogue box, and moving across rooms. At this point I realised that the code was getting quite messy, and it was difficult to navigate through it on the p5js editor. I downloaded the folder, and switched to working on Brackets, an open source code editor, which also allowed me to quickly duplicate lines, and preview visuals. I also started packaging sections of code into functions, which I separated into different javascript files. This let me segment my code into different parts and made it quicker and easier to navigate and create mental models of the code structure.</p>\n<p><img src=\"https://salilparekh.work/img/museum-of-salil-3.png\" alt=\"Modified screenshot of Republic TV\" /><br />\n<em>Trying out different flooring options</em></p>\n<p>Once I was happy with the code, I started creating assets for the game. This took far longer than I had initially accounted for. Creating multiple sprites for the player controlled character took a full day. Animating is difficult, and perhaps even more difficult with the constraint of such few pixels. Communicating the motion of movement through the shifting of pixels is quite challenging. Although creating the spaces was easier in comparison, I used sprite maps from Pokémon Emerald to help me architect the spaces, and take colour and pattern references. Creating architectural elements in a pixel art style is tricky, and the spritesheet reference helped accelerate the process of creating the spaces.</p>\n<p>As the finished art assets were exported, I started to integrate them into the game. The features within the assets guided the development of the game on top of the basic functionality. For example, the new completed character needed a different control setup as compared to the version used for the whiteboxing. The walls and and other elements in the assets facilitated the addition of colliders to prevent the character from escaping the canvas. The exhibits required the addition of triggers, which would trigger the dialogue box to appear, with the correct text to appear. The lines of code kept increasing, and I would keep separating the functions into new javascript files to retain readability.</p>\n<p><img src=\"https://salilparekh.work/img/museum-of-salil-4.png\" alt=\"Modified screenshot of Republic TV\" /><br />\n<em>Overview of the code</em></p>\n<p>Every new challenge or difficulty presented me with an opportunity to refactor my code, and clean it up. Iteration by iteration, the game started to take shape, with new features being added, and old ones removed. This process got me to do some more research on p5js and the p5 play library–which helped me simplify the code and make it more efficient. I did run into a bizarre problem, in which the frame rate of the game would drop from a constant 30fps to 1fps within half a minute. After having studied the performance logs, I spotted the culprit. I was drawing the collider sprites for the walls every frame, which was causing the brutal slowdown. I implemented a system which would behave as a pseudo-setup() function by checking for NPC sprites. If there weren't any, the that block of code would run, before populating the scene with NPC sprites. This helped me create the wall sprites one, and thus resolving the performance issue.</p>\n<p>As the game development concluded, I shared a copy of the game with a few of my friends to playtest it and get some feedback. From this feedback, I implemented a more efficient interaction strategy, improved readability, added new dialogues, and added interactive elements. This was an important part of the process as it helped me verify the narrative strategy, and helped improve the playability of the game.</p>\n",
      "date_published": "2020-08-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/sky-globe/",
      "url": "https://salilparekh.work/posts/sky-globe/",
      "title": "Sky Globe",
      "content_html": "<p>When I look up at the sky, I might see an airplane or two, but apart from a few rare sightings, the sky seems relatively empty. However, a quick glance at a (pre-COVID) flight schedule says anything but. Our skies are quite literally filled with airplanes, especially in a city with an airport. However, this data is quite difficult to visualise, let alone see even. Taking data from <a href=\"http://opensky-network.org/\">opensky-network.org</a> ↗, I created a Sky Globe which allows you to see the airplanes in the skies above your location.</p>\n<iframe width=\"610px\" height=\"610px\" src=\"https://burnedsap.github.io/sky-globe/\"></iframe>\n<p><em>See what's above you</em></p>\n<p>Sky Globe takes your location, and visualises the aircraft flying above you in real time. It shows all aircraft within an area of 295km around your location. Airplanes do fly awfully quickly, and a wider catchment area allows us to see aircraft that might be passing on the periphery of your location. The sketch also shows the visualisation of the altitude and traces the path of the aircraft as it passes through the sky. The position of the aircraft updates every 5.5 seconds. Each aircraft is marked with it's callsign and the country of origin. The information on display has been kept to a minimum to allows viewers to have a clear and unimpeded view of the visualisation.</p>\n<p>The sketch uses the opensky-network API to pull in aircraft coordinates and metadata. My intent with this sketch was to visualise and unveil the often hidden activities in the skies above us. Not all aircraft flying are commercial, cargo, private, or military. Some aircraft have hidden agendas, often hidden behind false callsigns. This <a href=\"https://thewire.in/political-economy/the-unfinished-india-story-of-a-ukraine-plane-and-a-bribery-investigation\">article</a> ↗ elucidates one such incident. Websites such as FlightAware and FlightRadar24 do show the aircraft in our vicinity, but it's difficult to visualise the data with a 2D visual. The source of the data is not clear with these commercial websites. The data on opensky-network is crowd-sourced, and hence aircraft cannot be hidden unless they switch off their ADS-B transponders (highly unlikely as they won't show up on ATC radar, which has major safety implications).</p>\n<p><img src=\"https://salilparekh.work/img/sky-globe-1.png\" alt=\"Initial prototype\" /><br />\n<em>Initial prototype</em></p>\n<p>Before creating the 3D version, I initially tried using a standard 2D version of the sketch which would reveal aircraft information on mouse hover.</p>\n<p><img src=\"https://salilparekh.work/img/sky-globe-2.png\" alt=\"Resolving 2D vector math\" /><br />\n<em>Resolving 2D vector math</em></p>\n<p>However, this variation wasn't very useful in displaying information as it didn't illustrate the position of the aircraft in relation to the viewer. The 3D view was important in conveying relative position of the aircraft in the sky.</p>\n<h3 id=\"development\" tabindex=\"-1\">Development <a class=\"direct-link\" href=\"https://salilparekh.work/posts/sky-globe/#development\" aria-hidden=\"true\">#</a></h3>\n<p>Developing this was far more complicated than I initially imagined. There were a lot of moving parts, although mostly to do with the visualisation rather than navigating the API itself. One of the biggest challenges was creating the trails in the sky, as well has having background refresh. However, this meant that I had to develop a system to identify individual aircraft and update their locations without creating a new array of aircraft everytime.</p>\n<p><img src=\"https://salilparekh.work/img/sky-globe-3.png\" alt=\"Resolving 2D vector math\" /><br />\n<em>Aircraft over NYC</em></p>\n<p>Having figured out the data structures of the aircraft lists, I had to figure out how to create the trails for each aircraft, which would extend from the coordinates. I used a slightly complicated solution of creating two PVectors which would extend from the 3D coordinates to create each edge of the trail. This was needed as it would adapt to the rotation of the aircraft (another maths challenge to solve!) as it turned. Along the journey, I even made a case for, and advocated a <a href=\"https://github.com/processing/p5.js/issues/4767\">contribution</a> ↗ to p5.js!</p>\n",
      "date_published": "2020-07-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/lockdown-doors/",
      "url": "https://salilparekh.work/posts/lockdown-doors/",
      "title": "Lockdown Doors",
      "content_html": "<p>Watch a week in my pandemic life told through the opening and closing of the door to my room. Hover over the doors to read more!</p>\n<iframe width=\"1010\" height=\"810\" src=\"https://burnedsap.github.io/lockdown-doors/\"></iframe>\n<p><em>Hover over the doors to see what happens! If it doesn't load, click <a href=\"https://burnedsap.github.io/lockdown-doors/\">here</a> ↗.</em></p>\n<p>Data visualisation has always seemed quite straightforward to me. Telling stories with the help of data is easy enough. There's plenty of ways to do so, for example using bar graphs, pie charts, alluvial diagrams, waffle grids, amongst others. However I've never given much thought to embedding stories and narratives within the data visualisation. Telling a personal story through a period of time with data is not something I'm familiar with.</p>\n<p><img src=\"https://salilparekh.work/img/lockdown-doors-1.jpg\" alt=\"Initial prototype\" /><br />\n<em>Ideation sketches</em></p>\n<p>I wanted to track a data point which is unique to my context and surroundings. I initially thought of tracking my digital behaviours, but it wasn't an accurate reflection of me, in this moment. I narrowed in on either tracking the number of times I would bite my nails, or the number of times the door to my room would open. However I quickly realised that the moment I would become aware of biting my nails, I would stop doing it. Although it's a great way to perhaps stop biting my nails, I'd probably end up with no data, or inaccurate data. And so I started tracking the number of times I would open the door to my room.</p>\n<p><img src=\"https://salilparekh.work/img/lockdown-doors-2.jpg\" alt=\"Resolving 2D vector math\" /><br />\n<em>Sketching out the layout</em></p>\n<p><img src=\"https://salilparekh.work/img/lockdown-doors-3.png\" alt=\"Resolving 2D vector math\" /><br />\n<em>Collecting data</em></p>\n<p>Before I started tracking the data, I wanted to figure out what my visualisation would look like. This would help define the parameters I would need to collect.</p>\n<p>Although I initially got bogged down in trying to use traditional data visualisation techniques, I realised that they didn't convey the essence of the data. I wanted to convey the long gaps in between me opening my door. I wanted to tell the story of my routine through the opening of the door.</p>\n<p>Finally, I figured out a simple solution to the problem. Just as I would draw out my idea or the story I wanted to convey, the data visualisation would do the same thing.</p>\n",
      "date_published": "2020-07-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/helf-and-caree/",
      "url": "https://salilparekh.work/posts/helf-and-caree/",
      "title": "Helf and Caree",
      "content_html": "<div class=\"three-grid\">\n<div class=\"intro-desc\">\n<h4>Introduction</h4>\n<span>This is (now) online is a collaborative zine-making game conceptualised by Pulp Society and The Irregulars Art Fair during the COVID-19 lockdown. Nirmal Ravisyam and I were paired up to create a zine together with the theme \"Water wets and fire burns\". I worked with a machine learning algorithm to generate speculative headlines, which were used as prompts to write articles. Nirmal created visuals for the generated headlines and the resulting articles.</span>\n</div>\n<div>\n<h4>Role</h4>\n<span>Writer</span>\n</div>\n<div>\n<h4>Collaborator</h4>\n<span>Nirmal Ravisyam</span>\n</div>\n</div>\n<p>Over the course of a few weeks, 78 artists, illustrators, writers and first-time makers collaborated in a unique digital program to make 16 zines. As an attempt to combat the loneliness and creative isolation resulting from the lockdown, Pulp Society x TIRAF created two digital games - Exquizine and Blind Date — in hope of energising the creative community through the power of collective action. The participating artists along with Pulp Society x The Irregulars Art Fair donated the proceeds of this collaboration to the COVID-19 relief work.</p>\n<div class=\"two-grid\">\n<p><img src=\"https://salilparekh.work/img/helf-and-caree-1.png\" alt=\"Generative visual with random unicode characters\" /></p>\n<p><img src=\"https://salilparekh.work/img/helf-and-caree-2.png\" alt=\"Generative visual with random unicode characters\" /></p>\n</div>\n<p>Helf and Caree is a zine co-created with Nirmal Ravisyam. I crafted fake headlines with the help of GPT-2 and LSTM machine learning algorithms, which were then used as writing prompts to paint a picture of an absurd, speculative reality inspired by our own. Nirmal created a variety of mixed-media illustrations that both complement and contradict the writing to create something halfway between a newspaper and a comic book.</p>\n<p><img src=\"https://salilparekh.work/img/helf-and-caree-3.jpg\" alt=\"Zine cover\" /><br />\n<em>Zine Cover</em></p>\n<p><img src=\"https://salilparekh.work/img/helf-and-caree-4.jpg#fullwidth\" alt=\"Spreads from the zine\" /></p>\n<p><img src=\"https://salilparekh.work/img/helf-and-caree-5.jpg#fullwidth\" alt=\"Spreads from the zine\" /><br />\n<em>Spreads from the zine</em></p>\n<p>This zine is meaningful and significant for the times we live in, where social media has become the generator of news, and sometimes and more importantly fake news. Prime Ministers and the powers that be are counting on it and citizens are taking it in without the much-needed pinch of salt. It is a poignant reflection of 2020 with our very own influencer marketing, social media journalism and vigilante justice.</p>\n<p><img src=\"https://salilparekh.work/img/helf-and-caree-6.jpg#fullwidth\" alt=\"Spreads from the zine\" /><br />\n<em>How far removed from reality is this? If at all...</em></p>\n",
      "date_published": "2020-05-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/air-pollution-landscape-of-india/",
      "url": "https://salilparekh.work/posts/air-pollution-landscape-of-india/",
      "title": "Air Pollution Landscape of India",
      "content_html": "<p>NDA Project–Please get in touch to learn more!</p>\n",
      "date_published": "2020-05-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/accessible-financial-planning/",
      "url": "https://salilparekh.work/posts/accessible-financial-planning/",
      "title": "Accessible Financial Planning",
      "content_html": "<p>NDA Project–Please get in touch to learn more!</p>\n",
      "date_published": "2020-02-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/speculative-sunday/",
      "url": "https://salilparekh.work/posts/speculative-sunday/",
      "title": "Speculative Sunday",
      "content_html": "<p>EyeMyth is the only Media Arts Festival in India - unique in its intersection of Indian and Global art, culture and technology. A 3-day festival which took place from November 29th to December 1st 2019, the third day, called <strong>Speculative Sunday</strong> was devoted to speculating the cultural futures of India.</p>\n<p><img src=\"https://salilparekh.work/img/eyemyth-1.png#fullwidth\" alt=\"EyeMyth Poster\" /></p>\n<p><img src=\"https://salilparekh.work/img/eyemyth-2.jpg\" alt=\"EyeMyth Poster\" /></p>\n<p>Speculative Sunday is a day devoted to hands-on workshops that visualise radical cultural futures for India, while learning new skills in Speculative Design &amp; Design Fiction. I was in charge of the entire day of the festival, which meant planning and designing everything from production, activities, people, to food, permissions and transport. With over a 100+ attendees, the day was a success and lots of learnings were gleaned from the day.</p>\n<p><img src=\"https://salilparekh.work/img/eyemyth-4.jpg\" alt=\"EyeMyth Poster\" /><br />\n<em>Avinash opening the day with an introduction to speculative design</em></p>\n<p>The success of Speculative Sunday was entirely down to the team which behind the larger EyeMyth Media Arts Festival, and I was very fortunate to have gotten the opportunity to work with them to design this day.</p>\n<p><img src=\"https://salilparekh.work/img/eyemyth-5.jpg\" alt=\"EyeMyth Poster\" /><br />\n<em>Attendees browsing the speculative toolkits given to them</em></p>\n<div class=\"two-grid\">\n<p><img src=\"https://salilparekh.work/img/eyemyth-11.jpg\" alt=\"EyeMyth Poster\" /><br />\n<em>Kickinng off introductions with speculative job titles</em></p>\n<p><img src=\"https://salilparekh.work/img/eyemyth-10.jpg\" alt=\"EyeMyth Poster\" /></p>\n</div>\n<p><img src=\"https://salilparekh.work/img/eyemyth-6.jpg\" alt=\"EyeMyth Poster\" /><br />\n<em>A workshop on developing and delivering Art-Design-Technology Projects of the Future by Dr. Betty Sargeant</em></p>\n<p><img src=\"https://salilparekh.work/img/eyemyth-7.jpg\" alt=\"EyeMyth Poster\" /><br />\n<em>Edible Issues taking a workshop on the future of food in India</em></p>\n<p><img src=\"https://salilparekh.work/img/eyemyth-8.jpg\" alt=\"EyeMyth Poster\" /><br />\n<em>Attendees signing up for workshops</em></p>\n<p><img src=\"https://salilparekh.work/img/eyemyth-12.jpg\" alt=\"EyeMyth Poster\" /><br />\n<em>Speculative Design workshops led by Quicksand team members</em></p>\n<p>The day started with ‘Bhavishya Bhojanalaya’ - a futuristic brunch curated by India’s leading food provocateur and chef Gresham Fernandes in collaboration with ‘The Good Slice’.</p>\n<p>Next up, a unique, fast-paced co-creation workshop on ‘Speculative Design’ - an increasingly in-demand global skillset for creatives. 20 groups led by expert facilitators on a hands-on, co-creation journeys into the future of Mumbai and India in 2040.</p>\n<p>Supported by : British Council, Pro Helvetia Swiss Arts Council, Social</p>\n",
      "date_published": "2019-12-02T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/fig/",
      "url": "https://salilparekh.work/posts/fig/",
      "title": "FIG, a GIF Festival",
      "content_html": "<p>FIG is an ONLINE + OFFLINE exhibit celebrating the power of the GIF. It is a small part of a larger study on the evolving internet expressions of our age – freshly incubated at the Eyemyth Festival 2019.</p>\n<p><img src=\"https://salilparekh.work/img/fig-5.png#fullwidth\" alt=\"DR\" /><br />\n<em>The FIG website</em></p>\n<p>As a part of the EyeMyth Media Arts Festival, FIG was a showcase of GIF's from artists around the world on the theme: <strong>The Loss of Creativity.</strong></p>\n<p><img src=\"https://salilparekh.work/img/fig-2.png#fullwidth\" alt=\"DR\" /></p>\n<p>An open call for submissions was received with enthusiasm from the GIF community, with submissions on display on all digital screens at the Festival and online. The <a href=\"https://burnedsap.github.io/fig/\">website</a>, just like a GIF, loops infinitely!</p>\n<p><img src=\"https://salilparekh.work/img/fig-4.png#fullwidth\" alt=\"DR\" /><br />\n<em>The online gallery</em></p>\n<p><img src=\"https://salilparekh.work/img/fig-3.png#fullwidth\" alt=\"DR\" /><br />\n<em>A submission from Anisha Thampy</em></p>\n<p>A small excerpt from a piece I wrote for the <a href=\"https://thehardcopy.co/indian-gifs-time-to-take-centre-stage/\">HardCopy.co</a>:</p>\n<p><span>&quot;It is for this reason that a few of us within Quicksand, decided to create a space for Gif creators to showcase their work. The platform is called FIG, and was launched a few months ago. FIG’s mission is to celebrate the creation of Gifs by designers, illustrators, artists, writers and creators of all kinds. We opened up calls for submissions on the theme of ‘The Loss of Creativity’ and we received around forty amazing entries. This is just the beginning for the platform, and we hope to do a lot more for Gif creators.  The team behind FIG are creators who love making Gifs using diverse digital and analogue techniques, and we wish to reach out to other creators who feel equally passionate about them.&quot;&quot;</span></p>\n",
      "date_published": "2019-12-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/the-speculative-design-workshop/",
      "url": "https://salilparekh.work/posts/the-speculative-design-workshop/",
      "title": "The Speculative Design Workshop",
      "content_html": "<p>The Speculative Design Workshop was a day of co-creation, where the participants were introduced to frameworks, toolkits, and theories from the world of speculative design. It was a way of looking at Médecins Sans Frontières (MSF)’s practice and the crises they aim to respond to through a fresh perspective, and reveal opportunities to critique, reshape, and innovate.</p>\n<p><img src=\"https://salilparekh.work/img/tsdw-12.jpg#fullwidth\" alt=\"Introducing speculative design to the participants at the Quicksand Studio\" /><br />\n<em>Introducing speculative design to the participants at the Quicksand Studio</em></p>\n<p><img src=\"https://salilparekh.work/img/tsdw-2.jpg\" alt=\"Name tags for participants\" /><br />\n<em>Name tags for participants</em></p>\n<p><img src=\"https://salilparekh.work/img/tsdw-3.jpg\" alt=\"Schedule of the workshop\" /><br />\n<em>Schedule of the workshop</em></p>\n<p>Organised ahead of MSF Scientific Days in Delhi, 15 members of MSF from diverse backgrounds participated in a day-long workshop hosted at Quicksand Studio. The day began with participants playing fun games and opening up to thinking about the future. Through the day they spent time world-building and speculating how crises will evolve over the years, ending at present day: 2035. They detailed out their worlds through photo collaging and narrative writing exercises.</p>\n<p><img src=\"https://salilparekh.work/img/tsdw-4.jpg#fullwidth\" alt=\"Speculating on the future of MSF\" /><br />\n<em>Speculating on the future of MSF by creating a timeline</em></p>\n<p><img src=\"https://salilparekh.work/img/tsdw-7.jpg#fullwidth\" alt=\"A complete, populated timeline speculating the near, and far future. (they predicted the pandemic)\" /><br />\n<em>A complete, populated timeline speculating the near, and far future. (they predicted the pandemic)</em></p>\n<p>They engaged further with Speculative Design through role playing and artefact modelling activities, immersing into the worlds they built. The workshop came to an end with a sharing session where both the participants and the facilitators shared their reflections and discussed further steps for collaboration and a future for the workshop.</p>\n<p><img src=\"https://salilparekh.work/img/tsdw-5.jpg\" alt=\"'Living' the future through role-playing based on MSF's predictions\" /><br />\n<em>'Living' the future through role-playing based on MSF's predictions</em></p>\n<p>The post-workshop discussions were lucid and free, as participants were able to look into the future and make confident decisions regarding the future of MSF as an organisation and the role they would play in the near future. It was unanimously acknowledged that the future of MSF was perhaps quite different from they thought it would be, prior to the workshop. This is exactly what The Speculative Design Workshop intended to do: allow participants to reflect on the present after having experienced the future. The workshop with it's format and branding was to be pitched to other organisations, to help teams strategise and prepare for the future.</p>\n<div class=\"two-grid\">\n<p><img src=\"https://salilparekh.work/img/tsdw-9.jpg\" alt=\"Prototyping solutions from role-playing activities\" /><br />\n<em>'Prototyping solutions from role-playing activities</em></p>\n<p><img src=\"https://salilparekh.work/img/tsdw-11.jpg\" alt=\"Prototyping solutions from role-playing activities\" /></p>\n</div>\n",
      "date_published": "2019-08-20T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/love-in-the-time-of-digital/",
      "url": "https://salilparekh.work/posts/love-in-the-time-of-digital/",
      "title": "Love in the Time of Digital",
      "content_html": "<p>An increasing number of young people are turning to digital mediums for information, entertainment and networking. In the ASRH sector too, adoption of digital technologies is gaining momentum. Therefore, it is fast becoming an imperative for the sector to develop standards and guidelines for designing, managing and evaluating interventions that leverage these technologies to achieve their outcomes.</p>\n<p>This project seeks to arrive at a prototype of a framework that can be used to plan, implement and evaluate digital-platform based interventions designed to aid Adolescent Sexual and Reproductive Health outcomes (ASRH). These include improved knowledge, reduced teenage pregnancies, a drop in Sexually Transmitted Infections, increased consumption of SRH services by the adolescents and a change in their behaviour towards sexual and reproductive health.</p>\n<p>The absence of definitive data on what works to ensure healthy childhood-to-adulthood transitions poses a challenge in developing policies and program interventions that can lead to holistic development. The Population Council has responded to these gaps through a research project, ‘Understanding the lives of adolescents and young adults’, Project UDAYA, in Uttar Pradesh and Bihar. Insights from the UDAYA study show that a growing number of programs and interventions are using Information and Communication Technology (ICT) to reach and engage with adolescents, and to build their knowledge and awareness on pertinent issues.</p>\n<p>A sector where this medium has been especially salient has been Adolescent Sexual and Reproductive Health (ASRH). In India’s context, where adolescent sexuality is taboo, digital media and communication has allowed for innovative programming that circumvent challenges of social stigma, judgment and bias to reach adolescents in a safe and private manner. However, many such interventions lack rigorous monitoring and evaluation, which gives rise to the need for more clarity on the impact such programs can potentially have, and the strategies that can optimise this impact.</p>\n<p>This project was conceptualised to address gaps such as these. It seeks to understand the overall landscape of ASRH programming through digital media and ICT in India, identify strengths and weaknesses in these approaches, and suggest a framework and tools that could enhance the effectiveness of these interventions across their lifetimes.</p>\n<p>The Quicksand team, along with collaborations with experts from various fields, and an Impact Lab engaged in researching three organisations that had taken the digital route in their ASRH program journey. Quicksand’s role was to gather learnings from the experiences of the three organisations along with learnings from the commercial sector and facilitate a conversation around key emergent themes between the stakeholders so as to compile a draft framework.</p>\n<p><img src=\"https://salilparekh.work/img/lttd-1.jpg\" alt=\"Presenting the findings from the research to stakeholders\" /><br />\n<em>Presenting the findings from the research to stakeholders</em></p>\n<p>The three organisations that were researched were chosen chosen to bring a representative mix of technology, scale of intervention, duration of intervention, and the locational context. The scope of the study limited the research to these three platforms, which were Love Matters India, Kahi Ankahi Baatein (by CREA), and M-Sathi (by Restless Development).</p>\n<blockquote>The project led to creation of a framework and a detailed research paper. The framework, called the Platform Journey Framework maps out the stages of a digital intervention, and the various factors the intervention would have to take into account through its life-cycle. This framework is of particular value for both the organisations who wish to use digital interventions and the organisations who fund such projects.</blockquote>\n<p><img src=\"https://salilparekh.work/img/lttd-2.jpg\" alt=\"Presenting the findings from the research to stakeholders\" /><br />\n<em>Draft of the Platform Journey Framework</em></p>\n<p>In conclusion, digital technologies offer great opportunities in the ASRH space and can become a significant enabling factor for organisations in the sector, who, with digital can take their ideas to scale and impact a lot more people than they would with traditional methods. Digital technologies also present a significant capacity challenge for a lot of stakeholders in the sector, who will need to realign their focus to also include technology skills to remain competitive as digital technologies are increasingly embraced. Furthermore, it remains critical that the subject matter expertise and on ground connect that many organisations in the sector already possess is further nurtured and partnered with technology and not in any way replaced by it.</p>\n<p><img src=\"https://salilparekh.work/img/lttd-3.jpg\" alt=\"Presenting the findings from the research to stakeholders\" /><br />\n<em>Workshopping ideas based off the proposed framework</em></p>\n<p>There are several pitfalls and dangers of using technology in a sensitive space like ASRH and the knowledge this sector already possesses should help mitigate the risks and mediate the adoption of technology. The journey of a digital platform with its components presented in this report is a prototype that we hope will be further refined through interactions and testing with a diverse range of organisations and programs in the sector that are leveraging digital technologies. We hope the report opens up new conversations and processes within organisations and the sector at large, on how to design these platforms better, as well as in using data more effectively in measuring the impact of these platforms.</p>\n",
      "date_published": "2019-06-20T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/future-of-generative-art/",
      "url": "https://salilparekh.work/posts/future-of-generative-art/",
      "title": "Future of Generative Art",
      "content_html": "<p>Generative art is any piece of artwork that is autonomously generated using a series of instructions or following a set of rules. Although more commonly associated with art created using computers, I believe generative art is more about the artistic approach and the process, and not just about the tool. Similar to parametric architectural design, or algorithmic art, it is a result of a set of instructions defined by the creator. In this article, I trace through the history of generative art practice, to show how it can be the dominant art movement of the future.</p>\n<p><img src=\"https://salilparekh.work/img/future-of-generative-art-1.png\" alt=\"Screenshot of Miro board showing the research\" /><br />\n<em>Mapping everything generative art</em></p>\n<h3 id=\"the-past\" tabindex=\"-1\">The Past <a class=\"direct-link\" href=\"https://salilparekh.work/posts/future-of-generative-art/#the-past\" aria-hidden=\"true\">#</a></h3>\n<p>As computers became more and more accessible, artists started using computers to create art. This medium was appealing to artists as they could now create art that would have taken too long to create by hand. Artists could iterate their art, and accelerate their creative process. The computer also allowed for the exploration of visual styles that had never been seen before. The starkness and lack of human touch led to compositions that were completely unknown and alien. Computers became a tool for artists, like a paintbrush or a mechanical pencil, which allowed them to execute their ideas. Some of the first generative artists were researchers and scientists who used computers in their work, such as Michael Noll. Well-known pioneers in the Generative Art Movement are John Maeda, Vera Molnar, Manfred Mohr, Frieder Nake, Jared Tarbell amongst many others.</p>\n<p><img src=\"https://salilparekh.work/img/future-of-generative-art-2.png#fullwidth\" alt=\"Composition inspired by Casey Reas's work\" /><br />\n<em>Composition inspired by Casey Reas's work</em></p>\n<h3 id=\"the-present\" tabindex=\"-1\">The Present <a class=\"direct-link\" href=\"https://salilparekh.work/posts/future-of-generative-art/#the-present\" aria-hidden=\"true\">#</a></h3>\n<p>Today, it has become easier to find diverse tools to create generative art, causing a growth in the number of practicing generative artists. Artists like Casey Reas, Ben Fry, Daniel Shiffman, and Zach Lieberman have created both the tools and the art, to influence others to access and create generative works of their own.</p>\n<p><img src=\"https://salilparekh.work/img/future-of-generative-art-3.jpg\" alt=\"Generative visual with random unicode characters\" /><br />\n<em>Generative unicode piece</em></p>\n<h3 id=\"the-future\" tabindex=\"-1\">The Future <a class=\"direct-link\" href=\"https://salilparekh.work/posts/future-of-generative-art/#the-future\" aria-hidden=\"true\">#</a></h3>\n<p>The practice and popularity of generative art has evolved along with technological advancements. Now, we are at the cusp of tools such as machine learning, and perhaps one day, artificial intelligence— that can change the landscape of generative art. These technologies will allow artists to unlock doors to an era of art we haven’t even imagined yet. Artists such as Memo Atken, Mario Klingemann, Refik Anadol are not only using existing machine learning tools to create art, but also contributing to the field of machine learning through their practice. I started creating generative art about 7 years ago, using a tool called Processing. As an artist and designer, I was enamoured by the potential to use design to create art. Processing became my canvas, and code was my brush. Generative art processes have allowed me to translate complex concepts and thoughts into art. I feel generative art is poised to become the dominant art movement of the future, that will push us to create art, the likes of which have never been imagined before.</p>\n",
      "date_published": "2019-05-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/data-of-a-third-kind/",
      "url": "https://salilparekh.work/posts/data-of-a-third-kind/",
      "title": "Data of a Third Kind",
      "content_html": "<p>Over the last few years, I’ve been trying to play with data, and extrapolate meaning from datasets. It’s all very functional, and the more complex the dataset, the more fun it’s been to find correlations and overlaps. It does get dull at times, and very frustrating when nothing seems to work out. There are many tools with which data can be handled with, be it the ever functional spreadsheet, the notepad file, or even the back of a tissue paper. My weapon of choice is an IDE called Processing. An IDE, or Integrated Development Environment is a platform that allows for the compilation of code, amongst other functions. Created by Ben Fry and Casey Raes, Processing uses an abstracted version of Java, which makes coding a lot more accessible to visual artists who have no prior experience with programming. What makes Processing different from other tools for working with data is that it can not only work with a lot more data, but also different kinds of data.</p>\n<p>Sound is a very strange medium. I’ve always thought of sound as a very powerful tool, which can affect my emotional experiences deeply. We hear sound when our eardrums “feel” the vibrations of the air around us, and perceive that to be sound. A combination of sounds forms a musical composition. Many tend to hear music, or feel it. But I’ve started to see music in a different perspective. To show you what I mean, this is what music looks to me nowadays:</p>\n<p><img src=\"https://salilparekh.work/img/data-of-a-third-kind-1.png#fullwidth\" alt=\"Data file of music split into FFT frequencies\" /></p>\n<p>The numbers are a result of an FFT analysis of the sound. FFT, also known as Fast Fourier transform, breaks down the sound into its individual frequencies, which is what you see above. These numbers are the components of the music you hear, defining each vibration that enters your ear. The thought of music, which is so powerful and often indescribable, being broken down into numbers is so exciting and fascinating. Quantifying something which can’t be easily described.</p>\n<p>Now that we have these values, what do we do with them? Using Processing, I started experimenting with printing music, and making sound visible. These values are the bridge between hearing something and visualising it. The frequencies described in this dataset are exactly what you hear, so it stands to reason that these values might also be equally useful when trying to “see” sounds.</p>\n<p>So I started printing these values out, in simple shapes and forms to see what sounds looks like.</p>\n<p><img src=\"https://salilparekh.work/img/data-of-a-third-kind-2.png\" alt=\"Data file of music split into FFT frequencies\" /></p>\n<p><img src=\"https://salilparekh.work/img/data-of-a-third-kind-3.jpeg\" alt=\"Data file of music split into FFT frequencies\" /></p>\n<p><img src=\"https://salilparekh.work/img/data-of-a-third-kind-4.png\" alt=\"Data file of music split into FFT frequencies\" /></p>\n<p>It is fascinating no doubt, but it seemed to lack something important. These visuals were too static. Sound is an active phenomenon, always changing, full of energy and life. To inject that spark of life into the visualisations, I switched tack and started work on visualising sound, rather than printing static images.</p>\n<iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/lY9FNQ2zu8Q\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n<p>I could finally see progress now. There’s still a lot of work to be done, but this was a step in the right direction. The energy of the sound I was hearing was finally starting to make itself seen. The visuals looked like they had life in them.</p>\n<p>In every experiment, most of my efforts went into massaging the values, working with mathematical functions and logic gates to induce small amounts of intelligence into the code to allow sound to control the visuals. I didn’t want to get in the way of the sound producing visuals. I simply gave it some rules and restrictions to follow, and let the sound dictate everything else. It is amazing to see how mathematics and logic play such a big role in understanding and creating sound and visuals, the mainstays of traditional art.</p>\n<p>To push myself, I took up the 36 Days of Type challenge to see how I could creatively visualise the data derived from sound everyday. The goal was to use the data differently for every letter, and start using increasing levels of intelligence, by giving the sound more autonomy in creating visuals.</p>\n<iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/xEMqUubhzL4\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n<iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/zg-CE5OOfD8\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n<p>I’ve just started to scratch the surface on the possibilities here, and I still have to start analysing sound a lot more deeply to understand the smaller nuances. But the process of doing is truly very enjoyable, and it is fascinating to see how minor changes in frequency can dramatically alter the impact of sounds.</p>\n<p>By affecting the manner in which the values change, the visuals can be dramatically altered. The more intricately the values are calculated and managed, the more detailed the visuals can get. It’s a bit like mathematical surgery, fine-tuning the values and mathematical functions to get the desired results.</p>\n<p>Whoever said mathematics wasn’t fun?</p>\n<iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/gsAdXX9vbmg\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n<iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/dYE8p7xdZaM\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n",
      "date_published": "2019-05-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/uncdf-finlab-toolkit/",
      "url": "https://salilparekh.work/posts/uncdf-finlab-toolkit/",
      "title": "UNCDF FinLab Toolkit",
      "content_html": "<p>The UNCDF Financial Innovation Lab runs challenges to find and support solutions that help to promote inclusive and connected digital economies. As part of the Financial Innovation Lab, the United Nations Capital Development Fund (UNCDF) issues challenges to innovators in global markets across Asia, Africa, and the Pacific. The challenges reflect obstacles to inclusion in each market, that digital technologies present an opportunity to address. The challenges aim to stimulate the growth of new businesses and ideas to drive the development of inclusive digital economies.</p>\n<p><img src=\"https://salilparekh.work/img/uncdf-finlab-toolkit-2.jpg#fullwidth\" alt=\"The inimitable M.P. Ranjan\" /></p>\n<p>The Financial Innovation Lab is a community of practice energised by its mission to achieve digital financial inclusion for the elimination of poverty worldwide. An initiative of the UN Capital Development Fund (UNCDF), the Lab aims to increase the accessibility of digital financial services and products for low- and middle-income people in Africa, Asia, and the Pacific by sharing knowledge and providing resources to develop impactful solutions.</p>\n<p><img src=\"https://salilparekh.work/img/uncdf-finlab-toolkit-4.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Practice pitching</em></p>\n<p><img src=\"https://salilparekh.work/img/uncdf-finlab-toolkit-8.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Synthesising primary research conducted during the bootcamp</em></p>\n<p><img src=\"https://salilparekh.work/img/uncdf-finlab-toolkit-3.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Working with the finalists of the bootcamp to refine value propositions</em></p>\n<p>18 fintech start-ups were selected to work with UNCDF to develop and refine innovative new solutions. They attended the UNCDF led Bootcamps to learn and apply the design thinking process, working with mentors and partners from Bank Negara and MDEC amongst other companies. Quicksand was brought in as facilitators for the first cohort, to conduct the bootcamp, and help the startups refine their offering to help serve the B40 population better. Documentation of the workshop can be found on <a href=\"https://www.uncdf.org/article/4472/making-malaysian-fintech-fairer\">UNCDF's website</a> ↗.</p>\n<p>Over the 3 bootcamps, the participants were introduced to the process of Human Centered Design, and used various tools to use design thinking to refine their offering. After the conclusion of the bootcamp, Quicksand was tasked to put together all the tools and exercises from the bootcamp into an easy to use resource. After initially putting together a toolkit using openly available and easily collaborative technologies, we explored other formats of delivering the same information. After a few small prototypes, we eventually settled on the idea of creating a micro-site.</p>\n<p><img src=\"https://salilparekh.work/img/uncdf-finlab-toolkit-9.png#imageborder\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Home page of toolkit website</em></p>\n<p><img src=\"https://salilparekh.work/img/uncdf-finlab-toolkit-11.png#imageborder\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Breaking down each section of the bootcamp into easy to follow tools and templates</em></p>\n<p><img src=\"https://salilparekh.work/img/uncdf-finlab-toolkit-10.png#imageborder\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Tools are designed to be easy to understand and used without facilitation</em></p>\n<p>This micro-site was powered by a spreadsheet on Google Sheets, and was hence still collaborative and easy to update. The website created is easy to use and presents information in various blocks, as would be required by the bootcamp participants and workshop facilitators. The tools and facilitation slides can be downloaded as required, with additional reference links provided where needed.</p>\n<p><img src=\"https://salilparekh.work/img/uncdf-finlab-toolkit-12.png\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Each tool is designed to be used by both facilitators and end users</em></p>\n",
      "date_published": "2019-01-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/mac-is-dead-long-live-the-mac/",
      "url": "https://salilparekh.work/posts/mac-is-dead-long-live-the-mac/",
      "title": "The Mac is dead. Long live the Mac.",
      "content_html": "<p><img src=\"https://salilparekh.work/img/arm-mac.png\" alt=\"\" /></p>\n<p>So this is it. The end of an era. Intel has seemingly confirmed that they will lose Apple as a customer in the next couple of years, possibly from 2020 onwards. This is a very exciting time for the Mac. Just like the switch from PowerPC to Intel, this is a major change which will herald a massive change in the world of personal computers, and could possibly redefine the very definition of a personal computer.</p>\n<p>Let's unpack this. But first, a bit of history.</p>\n<p>In 2005, Apple announced that they would be switching over from using IBM built PowerPC processors to Intel's x86 processors. Although PowerPC processors were very fast, they were quite power hungry and ran quite hot–undesirable qualities for use in a laptop. There were also issues with IBM being able to manufacture the chips on time. Steve Jobs decided enough was enough and announced the decision to switch over to Intel chips. This was easier said than done, as this wasn't a case of simply switching out the processors and hitting the restart button.</p>\n<p>To run Mac OS X on the Intel chips would require a complete rewrite of the operating system, as it would compile differently than on PowerPC chips. And as if changing the operating system wasn't itself a mountain to climb, every single application or piece of software written for the Mac would also need to re-created to be able to run on the new Intel processors. However, with some clever software writing to help developers, Apple managed to completely switch over to Intel chips within 2 years. A piece of software called Rosetta, allowed developers to run their PowerPC compatible software on Intel chips. Although this wasn't an ideal solution and some applications such as the Adobe Suite used by a large majority of Apple customers, needed to be completely rewritten in order to function on the new processors.</p>\n<p>As tumultuous and inconvenient those 2 years may have been, it was definitely worth it. Apple was back on top, making some of the most powerful machines their customers could buy. Intel kept on making bigger advances year on year, and the customers lined up to get their hands on a Mac. All was well. Apple used AMD or Nvidia graphics cards in their higher end specifications, and it's pro users were very happy. Fast forward to 2012, and the first noises of discontent could be heard. The Mac Pro wasn't as fast as it should have been, and Intel's turn of speed in both processor speed and manufacturing capability started to slow down. The next generation Retina display MacBook Pro lineup was announced in late 2012, and thereafter things started to go wrong. Apple was unable to update the 2012 model's adequately, and it took them until 2016 to launch the next generation model. Now ordinarily 4 years isn't that long a time, but with Intel's ever smaller rate of improvement, combined with Apple's obsession with creating thin and light computers was starting to affect the upgrade schedules of their pro users.</p>\n<p>Around this point of time, applications were starting to rely on parallel compute hardware, which dramatically accelerated their speed and efficiency in various tasks. Graphics processing units or GPU's were now becoming more and more popular as productivity software for creatives started to rely on them more heavily than ever. This is an important factor, as you shall see later on.</p>\n<p>Imagine this scenario. It's early 2016. You're a pro user, with the latest 15-inch MacBook Pro. You've got an Intel quad-core processor, which is a generation older than the competition, and an ageing Nvidia GPU, which barely gets the job done with the demands of newer pro software. It's been a few years, and you've held off buying a new laptop as you know Apple is launching the next generation MacBook Pro soon. The leaks promise a super thin and light laptop which is expected to pack the latest and greatest internal hardware. You're not happy as your work is getting affected, but no matter. The new Mac will be here soon, and all will be well. It's now October 27th, and Apple has finally revealed the new MacBook Pro, and now you're very angry indeed. The new laptops look fantastic, and come in Space Grey! But they are woefully inadequate at launch, barely faster than your current machine, and have absolutely no ports at all! Crucially they also don't have a pro-level GPU. What now?</p>\n<p>Apple had been concentrating on their mobile devices, namely the iPhone, and had clearly taken their eye off the ball, quite literally. There were reports of hardware and software teams being told to prioritise development for the iOS and iPhone. So say the rumours, but long story short, you were essentially getting screwed over by Apple. Betrayed even, one might say. To add to the misery, the laptops suffered battery issues, display issues, speaker blowouts, malfunctioning ports, and had chronically flawed keyboards which could turn a MacBook into a very expensive paperweight. Apple appeared to have not only shot themselves in the foot but had started painfully hacking away at every part of their legs with a machete. It was brutal to see this unfold.</p>\n<p>In 2018, Apple updated the MacBook Pro's with significant upgrades, but still suffered from the chronic keyboard issues and now, significant thermal throttling. The GPU's were still a sore point, and in 2018, did not officially support Virtual Reality, which is borderline criminal. Was this tragic or funny? Both perhaps.</p>\n<p>The current situation for a MacOS pro customer is not great at the moment. Short of spending a preposterous amount of money, the current lineup is average at best, and hopelessly underpowered in comparison to it's Windows rivals at it's worst. But, history often repeats itself, and I believe we are currently at the end of an era, and at the cusp of a new one. This change of guard is perhaps the most significant in the history of the Mac and looks set to propel the Mac back to where it belongs, right at the top.</p>\n<p>I'll have to rewind again and show you frame by frame in slow motion, how this change will come to pass. It all starts with the inception of the iPhone, back in 2007. Apple wanted to make a small and powerful phone, and at the time was looking at Intel to design and manufacture the processor. But Intel didn't see the value of investing in the design and production of a low power chip, and wanted to focus on creating products for laptops and desktops. Apple then worked with ARM, a small British company for the design of the main CPU, which was manufactured by Samsung. Intel did not see the smartphones or mobile devices as the future, and ultimately it missed the boat. Long story short, ARM has a large lead on the design of mobile chips, and it's licensing model allows customers to choose their own manufacturers which is a critical factor as it allowed Apple to negotiate a better deal and save money on manufacturing costs, instead of being held ransom by single supplied, for example, Intel. In 2019, chances are that the device you're reading this on, or a device you own, is probably powered by an ARM-designed chip. Both Qualcomm and Apple use ARM's architecture in the design of their mobile chips.</p>\n<p>These chips with ARM cores are excellent for use in mobile devices with their low power draw, and minimal thermal output. It's not only mobile devices which use them but now servers are also starting to use them for low power instances in a bid to cut electricity costs. ARM and Intel employ different instructions sets in their processors. ARM uses Reduced Instruction Set Computing (RISC) and Intel's x86 processors use Complex Instruction Set Computing (CISC). Although this largely doesn't matter as the electronic devices you might use, usually contain a mix of both sets of instructions. Both of them have their advantages and disadvantages for certain tasks, hence they will be found being used together.</p>\n<p>Intel designs and manufactures their own chips, which gives them greater control over their design and production, hence their ability to not only innovate across the board and create better products but also the privilege to charge more and hence, lead to increased profits. ARM, however, has a different business model. Advanced RISC Machine, ARM for short, designs the chip architecture, which they then license to other companies (such as Qualcomm), who will manufacture them and sell them to other companies (such as Samsung, Apple), who will use them in their device. This is usually the CPU, GPU or both. Other integral parts of a computer, such as the memory, connectors, radios, amongst others are designed and manufactured by other companies. Although Intel designs and manufactures CPU's and GPU's, the final product in the consumer's hands are an amalgamation of parts from various manufacturers.</p>\n<p>Mobile devices use a highly compressed form of this amalgamation called System on Chips. Abbreviated to SoC, this particular thumb-sized bit of silicon contains all the major parts of a computer, such as the CPU, GPU, memory, antennas, and so on. So Apple or Qualcomm will buy parts from various suppliers, or create their own, to eventually make an SoC. They will then sell these SoCs to other manufacturers, such as Samsung, or LG, or Google for them to use in their devices.</p>\n<p>As the rapid decline of the Mac unfolded, Apple was making huge strides with their mobile devices. As of 2019, the iPhone and iPad are some of the most powerful mobile devices you can buy, with great battery life to boot. Their A-series chipsets which power their devices are class-leading, and competitors are struggling to keep with the year-on-year improvements achieved by Apple. This is not purely down to the physical hardware itself, as the software running on those chips have been exceptionally well optimised to ensure efficient use of resources. Since 2011, their chips have gotten up to 36 times faster in multi-core tasks and 17 times faster in single core tasks. In comparison to its competitors, Apple has been focussing on ensuring that the hardware they design is used efficiently by the software they write. Navigating through marketing and PR fluff is quite a difficult task for the average consumer, as certain metrics advertised by manufacturers have next to no impact on the quality of their experience of the device they are trying to sell. Case in point, Qualcomm advertised the higher number of cores their SoC's had in comparison to Apple, but this didn't matter as there wasn't much software written for Android devices (which used Qualcomm's products) to take advantage of those extra cores. Extra cores are usually attributed to better multi-tasking performance and better battery life and more.</p>\n<p>Now diverging back to the Mac, we can now see a situation where Apple has the ability to create very powerful chips with ARM architecture, with exceptionally powerful GPU's, the likes of which can traditional gaming consoles. The caveat here is that the software has to be well optimised to ensure that these statements hold true. The potential for Apple to use ARM-based chips for the Mac is ripe, and we will probably see the first implementation in the model which will succeed the 12&quot; MacBook. Subsequently, the entire product lineup will eventually switch over to the new ARM-based chips, with the 'Pro' lineup' last to make the change. Intel will keep pushing the boundaries of what is possible, and there is still time left to convince Apple to retain their chips for the more powerful 'Pro' hardware.</p>\n<p>It is a little tricky to directly compare Apple's ARM-based A-series chips versus Intel's latest and greatest. Geekbench and SPEC2006 (synthetic benchmarking frameworks) results, amongst others, can be referenced, but the truth is altogether more complex. There isn't yet a benchmark which can conclusively prove if the A-series chips are faster or not. It's important to consider the fact that software optimisation is critical, hence inadequately optimised software can dilute the results.</p>\n<p>But taking the results as an aggregate, and applying some healthy speculation, we can probably make an assumption that the A12X Bionic, Apple's most powerful chip is about 30-40% slower than Intel's desktop-class i7 processors[i7 8700K]. Taking into account the A12X Bionic's lack of active cooling (which is to say, it doesn't have fans or any cooling mechanism), and dramatically lower power consumption, the gap doesn't seem so large after all. It's fair to say that the A12X may not be able to sustain the same performance over extended periods of time, but with adequate cooling, this limitation can also be overcome. The A13X could help paint a better picture of what is to come next, and whether Apple can sustain the rapid year-on-year performance leaps which could enable them to confidently use ARM-based chips in the MacBook. Another potential upshot could be a dramatic increase in GPU performance. We could see performance equivalent to the GTX 1070 or more without the need for a discrete GPU. Perhaps we could see a combination at work here, with the integrated GPU working an AMD supplied discrete GPU. It is possible that Apple can solely rely on their own GPUs by 2025, depending on the performance increases they can make.</p>\n<p>So how will the switch affect you? Well, the first thing you'd be worried about is the transition pains. Will your applications continue working? Apple’s XNU Kernel for macOS is compatible with x86 and ARM64, so it should be painless. There's also Marzipan for translating apps from iOS to MacOS, so it's likely that Apple will have a similar solution for native binaries to be converted to ARM - like back in the day when they had Rosetta. We might see one or two generations of MacOS which will still support older x86 apps, working through a translation layer or emulation, but eventually, Apple will kill support off, and become ARM only. Usually, it takes them two OS releases for this to happen, so 2020-22 with support for both x86 and ARM, and after 2022 probably ARM only.</p>\n<p>We will not only potentially see a healthy increase in battery life, but also a solid improvement in connectivity options. Potentially powerful WiFi antennas, even eSim capability perhaps. More realistically, additional hardware in the real of Machine Learning, and security. A good example is the T2 chips that ship with the latest MacBook Pros. The T2 chip not only handles encryption and security but also video encoding, specifically the new H.265 standard.</p>\n<p>There will still be some pain in making the switch, especially if Intel or AMD can find some huge gains in the next couple of years. Apple has always been exceptional in extracting performance from sub-par hardware, so at this point, it is difficult to imagine how the transition could play out.</p>\n<p>I honestly can't really figure out how this will play out, and what to look out for. But there is no smoke without some fire, so it's fair to say there is something big coming up on the horizon, and it should be an exciting, and perhaps actually revolutionary.</p>\n<p>Huge thanks to Coreteks for contributing to this piece, do subscribe to him on Youtube, and watch his latest video on future of Intel and AMD.</p>\n<p>Reference:</p>\n<p><a href=\"https://mashable.com/2016/06/29/intel-macs-at-10/#dqeByJREpkqp\">https://mashable.com/2016/06/29/intel-macs-at-10/#dqeByJREpkqp</a><br />\n<a href=\"https://appleinsider.com/articles/18/12/06/qualcomms-snapdragon-855-is-over-a-year-behind-apples-a12-bionic-lacks-a-premium-android-audience\">https://appleinsider.com/articles/18/12/06/qualcomms-snapdragon-855-is-over-a-year-behind-apples-a12-bionic-lacks-a-premium-android-audience</a><br />\n<a href=\"https://reveried.com/article/arm-processors-nearing-performance-parity-with-x86\">https://reveried.com/article/arm-processors-nearing-performance-parity-with-x86</a><br />\n<a href=\"http://www.slashleaks.com/l/apple-designed-arm-mac-processor-benchmarks\">http://www.slashleaks.com/l/apple-designed-arm-mac-processor-benchmarks</a><br />\n<a href=\"https://www.youtube.com/watch?v=IfHG7bj-CEI&amp;frags=pl%2Cwn\">https://www.youtube.com/watch?v=IfHG7bj-CEI&amp;frags=pl%2Cwn</a></p>\n",
      "date_published": "2019-01-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/upshift-social-innovation-curriculum/",
      "url": "https://salilparekh.work/posts/upshift-social-innovation-curriculum/",
      "title": "UPSHIFT Social Innovation Curriculum",
      "content_html": "<p>UPSHIFT is a youth social innovation and social entrepreneurship programme, designed to build skills and opportunities for young people who are disadvantaged, due to (for example) poverty, gender, disability or ethnicity. The programme empowers young people with the skills and resources they need to identify problems in their own communities and design solutions for them.</p>\n<p><img src=\"https://salilparekh.work/img/unicef-upshift-3.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Refining the curriculum with the UNICEF Tajikistan</em></p>\n<p>The UPSHIFT programme was started by UNICEF Kosovo, and it was very successful. UNICEF in Tajikistan too wanted to start their own UPSHIFT programme, and Quicksand was called in to help design the programme and facilitate the bootcamps. In the two weeks that the Quicksand team was in Dushanbe, we helped refine the human centered design methodology and design a bootcamp agenda which could subsequently be used by the UNICEF team to conduct further workshops.</p>\n<p>Quicksand conducted a week-long Training of Trainers bootcamp with selected mentors from around Tajikistan. These mentors would then go on to facilitate UPSHIFT programmes in their communities.</p>\n<p><img src=\"https://salilparekh.work/img/unicef-upshift-16.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<img src=\"https://salilparekh.work/img/unicef-upshift-17.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Workshop to train mentors and trainers</em></p>\n<p><img src=\"https://salilparekh.work/img/unicef-upshift-6.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Mentors prototyping new facilitation strategies</em></p>\n<div class=\"two-grid\">\n<p><img src=\"https://salilparekh.work/img/unicef-upshift-1.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Getting comfortable with prototyping tools</em></p>\n<p><img src=\"https://salilparekh.work/img/unicef-upshift-13.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n</div>\n<p>The freshly minted UPSHIFT trainers then put the toolkit and their facilitation skills to the test with an UPSHIFT cohort in Dushanbe. Feedback from the trainers was then used to optimise the toolkit material.</p>\n<p><img src=\"https://salilparekh.work/img/unicef-upshift-9.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<img src=\"https://salilparekh.work/img/unicef-upshift-8.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Mentors putting their skills to the test with the initial UPSHIFT cohort</em></p>\n<p>A comprehensive toolkit was created, which was used by the UNICEF team and the mentors to train more mentors and use the HCD (Human Centered Design) process to help guide the adolescents on their social entrepreneurship journey.</p>\n<p>The facilitation guide and materials for the UPSHIFT Bootcamp are now available for download from <a href=\"https://www.unicef.org/innovation/UPSHIFTcurriculum\">UNICEF's website</a> ↗.</p>\n<p><img src=\"https://salilparekh.work/img/unicef-upshift-4.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Hello from Dushanbe!</em></p>\n",
      "date_published": "2018-09-20T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/rise-of-indian-digital-heritage/",
      "url": "https://salilparekh.work/posts/rise-of-indian-digital-heritage/",
      "title": "Rise of Indian Digital Heritage",
      "content_html": "<h3 id=\"what-lies-beyond-museums\" tabindex=\"-1\">What Lies Beyond Museums? <a class=\"direct-link\" href=\"https://salilparekh.work/posts/rise-of-indian-digital-heritage/#what-lies-beyond-museums\" aria-hidden=\"true\">#</a></h3>\n<p>India has had a long and complex history, traversing the Indus Valley Civilisation to years leading to the democratic Republic of India. We feel the effects of our turbulent history even today. Where is it possible to see such diversity? Not only in its people, but in the objects we see and the sounds we hear. We live amidst beautiful and symbiotic chaos, packed with surprises.</p>\n<p>Everything around us is a part of our culture and heritage. Not restricted to objects and architecture, but also spanning the sounds, smells and flavours of every locality. These elements are linked to time, and as time forges ahead, technological advancements leave their mark, leading to an evolution of our surroundings. And perhaps, inevitably — we will lose some elements of our culture.</p>\n<p>One might ask, isn’t this why we have museums, and other institutions dedicated to preserving history? Indeed they are guardians of past knowledge, but they also come with some limitations. Museums require the viewer to be physically present to see objects of the past. As cliche as it might sound, innovations in digital technology add an extra dimension to heritage conservation — that of interactivity, engagement and storytelling, which is missing in museums.</p>\n<p>For some time now, the process of archiving and exhibiting objects has been a tedious and physical process. Advances in technology can change this. By supporting digital heritage, as well as our physical heritage, we can use the full potential of computers to analyse objects and learn more about them than was ever possible before.</p>\n<p>An example of an initiative made towards digitally archiving heritage, is a project led by the Government Department of Science and Technology, which supports researchers in technology and humanities, to digitally document the landscape of Hampi, Karnataka. (<a href=\"http://digitalhampi.in/\">digitalhampi.in</a>). Immersive technologies like Virtual Reality, supported by game engines and techniques of photogrammetry push possibilities in heritage conservation, taking it a step ahead of digital archiving.</p>\n<h3 id=\"a-brief-history-of-virtual-reality\" tabindex=\"-1\">A Brief History Of Virtual Reality <a class=\"direct-link\" href=\"https://salilparekh.work/posts/rise-of-indian-digital-heritage/#a-brief-history-of-virtual-reality\" aria-hidden=\"true\">#</a></h3>\n<p>Virtual Reality is a technology we’ve had a love-hate relationship with for some time now. In 1968, Ivan Sutherland made the first prototype of a VR headset. Progress continued at a very slow rate right through the early 2000’s, with advancements in technology not being able to keep up with what was needed to make Virtual Reality feel truly immersive. In 2012, Oculus launched the Rift. It was the right product at the right price that revived the excitement of VR. It then proceeded to spark off an arms race in the world of VR, with manufacturers and software giants trying to outdo each other in their efforts to create high quality, yet accessible VR.</p>\n<p>The worlds we construct in VR can be infinitely imaginative. In many ways, this is as close to cognitive art as mediums can get. VR worlds are a lot like dreams, we can imagine anything we like and jump in whenever we wish to. Earlier, VR needed powerful hardware to ensure high quality immersive experiences. Now, with mobile VR, which can run on smartphones, that is changing.</p>\n<h3 id=\"the-power-of-game-engines\" tabindex=\"-1\">The Power of Game Engines <a class=\"direct-link\" href=\"https://salilparekh.work/posts/rise-of-indian-digital-heritage/#the-power-of-game-engines\" aria-hidden=\"true\">#</a></h3>\n<p>Game engines are easy to use software that allow us to create worlds to experience in VR. Previously an exclusive domain of experts, the democratisation of this technology allows even novices to begin creating. To build these VR worlds, 3D models and supporting assets are needed. Creating 3D models using traditional methods often takes a lot of time and is resource intensive. But a method once used for mapping during wartime, known as ‘Photogrammetry’ can be used to produce detailed and accurate 3D models. Photogrammetry is the craft of ascertaining measurement information between objects from photos. All you need are pictures of an object and a software that will process the pictures to generate 3D models!</p>\n<p>Putting all of the above together, a process is formed — Document artifacts with photogrammetry, create worlds with game engines, experience the same with VR and circulate to anyone with a smartphone. Last I checked, more than 300 million smartphones were sold in India alone. The components for digital heritage are ready, we just have to connect the dots.</p>\n<p>What separates digital heritage from traditional methods of heritage conservation, is not just the ability to shift everything into the digital world, but also the creative freedom to craft stories and narratives to the way in which we interact with history. This is what will make interactive VR experiences meaningful and educative in an effective and playful manner. The digital nature of the medium makes it a very fluid one; stories can be adapted for various languages and places to enhance its accessibility.</p>\n",
      "date_published": "2018-05-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/just-another-grocery-run/",
      "url": "https://salilparekh.work/posts/just-another-grocery-run/",
      "title": "Just Another Grocery Run",
      "content_html": "<p><span>The basement was dimly lit, quiet. I pressed the button on the key. A muffled click and a flash of the hazard lights indicated the car awaited my arrival. The interiors were warmly lit. A tug on the handle and the door swung open a full ninety degrees. I hoisted myself in, and the door followed me, thudding shut. Quiet enveloped me. My hands instinctively reached for the seat belt and secured me. The key slid into the ignition slot, and turned to activate the electronics. Lights flickered to life on the dashboard. Needles floated to their positions enclosed by their gauges. All warning lights flickered away except one. I depressed the handbrake, and the last warning switched off.</span></p>\n<p><img src=\"https://salilparekh.work/img/trip-to-grocery-store.jpg\" alt=\"\" /></p>\n<p>Foot on brake, I twisted the key as far as it could. A weak whirring gave way to a confident thrum. It was alive, and breathing. I let it sit still for a moment, letting it fully awaken. A gentle prod on the throttle was met with a eager grunt. It was ready. Headlights switched on, and the gear lever moved back to R. I slowly disengaged the brake pedal, letting it roll out slowly into position. Shifting the lever further back to D, the car rolls forward, heading down the narrow alleyway ahead. A 90 degree right turn comes up. The brakes are cold, and they grab the car to a near halt. A slow steering rack heaves it on to its left and completes the turn. A ramp to daylight gives the engine its first opportunity to stretch its legs. It does so grumpily, still cold from last nights sleep. I reach for the sunglasses as the first rays of intense light permeate the cabin.</p>\n<p>Eyes protected, I gingerly ease into traffic. I find myself holding up cars behind me as I crawl along, letting the engine warm up. The blue light flickers off, and I give the accelerator pedal a good stretch. The engine responds with annoyance, pushing me back into my seat. I hold on, letting the revs head north, savouring the first sounds of the VTEC, before easing off for a left turn. Now upto temperature, the brakes do as they’re told and arrest the car progress.. I hoist the car left, apexing early and let it run wide, correcting just before brushing the divider. The roads soon widen, and slow moving traffic appears in the distance. I cruise up to the back of this group, and rest my finger on the left paddle. When the time is right, tap it twice. For a moment, nothing changes. Then, three things happen simultaneously. I’m pushed back into my seat with violence as the engine throws a massive fit. Pushed beyond 3000 rpm, a demon posses the four cylinders, propelling the crankshaft with rage. The slow moving cloud of traffic is quickly overhauled, and slowly becomes ever smaller in the rear view mirror. I pull the right paddle, and within a moment, all calm is restored.</p>\n<p>The engine is purring along, the A/C is doing its job quietly and the stereo is calmly serving up tunes from my phone. It’s as if nothing had ever happened. The only evidence of the incident is the small grin on my face. As I continue on my way to pick up groceries, I’m looking for the next group of stragglers to pick off. The small joys of driving a regular car that likes being driven hard.</p>\n",
      "date_published": "2018-05-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/goa-heritage-project/",
      "url": "https://salilparekh.work/posts/goa-heritage-project/",
      "title": "Goa Heritage Project",
      "content_html": "<p>The Goa Heritage Project is a year long project funded by the British Council and the Prince Claus Fund to document and disseminate Goan heritage and culture through emergent art and technology platforms such as immersive media, video games and smartphone experiences. Our intention is to create and share a sustainable repository of digital heritage prototypes that are ripe for further development and incubation in partnership with the people and institutions of Goa.</p>\n<p><img src=\"https://salilparekh.work/img/ghp-10.jpg#fullwidth\" alt=\"Muse de Goa, a mobile game on living in a village in Goa\" /><br />\n<em>Muse de Goa, a mobile game on living in a village in Goa</em></p>\n<p><img src=\"https://salilparekh.work/img/ghp-3.png#fullwidth\" alt=\"Virtual Reality film on the Narkasur Festival\" /><br />\n<em>Virtual Reality film on the Narkasur Festival</em></p>\n<p>Bringing the voices of people into the design of future heritage experiences is key to the sustainability of culture, and our project explores various routes to participation in the design process. The artistic outcomes of this project live a parallel life as potential frameworks for collaboration that can bring greater vibrance and sustainability of cultural heritage to the state of Goa.</p>\n<p><img src=\"https://salilparekh.work/img/ghp-11.jpg\" alt=\"Interactive visual films on the history of Goa\" /><br />\n<em>Interactive visual films on the history of Goa</em></p>\n<p><img src=\"https://salilparekh.work/img/ghp-14.jpg\" alt=\"One of many comics created to highlight Goa's natural diversity\" /><br />\n<em>One of many comics created to highlight Goa's natural diversity</em></p>\n<p>Initial research started with a deep-dive into the world of Goan crafts. The research on Goan crafts led to the idea of using mediums such as Augmented Reality and Virtual Reality to document and disseminate the heritage and culture of Goa. The next step was to further understand the capabilities of the mediums we would be working with, and exploring the possibilities of what could be created. An in-depth exploration of the mediums was carried out, to understand the workflow of not only documenting and digitising physical artefacts, but also creating immersive and interactive outputs for our target audience to engage with. During this stage, the the process of photogrammetry was discovered, which was quickly mastered and a few sample outputs were created through which the workflow was tested.</p>\n<p><img src=\"https://salilparekh.work/img/ghp-13.png#fullwidth\" alt=\"One of the numerous Goan artefacts photogrammetried during the project\" /><br />\n<em>One of the numerous Goan artefacts photogrammetried during the project</em></p>\n<p><img src=\"https://salilparekh.work/img/ghp-7.png#fullwidth\" alt=\"Photogrammetry of a Portugese-era church\" /><br />\n<em>Photogrammetry of a Portugese-era church</em></p>\n<p>We also realised that mediums such as Augmented Reality and Virtual Reality were not ideal for all project outputs, and simpler mediums such as comics, films, mobile apps and music videos. Although Extended Reality Mediums of Augmented Reality and Virtual Reality did have their place, it was important to recognise that all mediums have a particular time and place for their ideal use.</p>\n<p>One of the key aspects of our research stage was to build new relationships and leverage existing partnerships. We realised that it was very important to have local experts inform the content and direction of our projects. These partners would also ensure that the project we collaboratively work on would have an audience, or a conduit through which to reach the audience through. Although not all collaborations directly led to a project output, the conversations and work from those relationships either contributed to some existing projects, or led to the creation of tangential projects through which we acquired further funding to continue work on specific inquiries.</p>\n<p><img src=\"https://salilparekh.work/img/ghp-12.jpg\" alt=\"On display at UnBox Festival 2018\" /><br />\n<img src=\"https://salilparekh.work/img/ghp-8.jpg\" alt=\"On display at UnBox Festival 2018\" /><br />\n<em>On display at UnBox Festival 2018</em></p>\n<p><img src=\"https://salilparekh.work/img/ghp-2.jpg\" alt=\"On display at Serendipity Arts Festival and Museum of Goa\" /><br />\n<img src=\"https://salilparekh.work/img/ghp-4.jpg\" alt=\"On display at Serendipity Arts Festival and Museum of Goa\" /><br />\n<img src=\"https://salilparekh.work/img/ghp-5.jpg\" alt=\"On display at Serendipity Arts Festival and Museum of Goa\" /><br />\n<em>On display at Serendipity Arts Festival and Museum of Goa</em></p>\n",
      "date_published": "2018-03-20T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/bambaiyya-vr/",
      "url": "https://salilparekh.work/posts/bambaiyya-vr/",
      "title": "Bambaiyya VR",
      "content_html": "<p>In this day and age, we are always running around doing something or the other. But sometimes when we pause and notice the world around us, we are suddenly pulled into this vacuum were we feel empty and question the meaning of our existence. We find it very difficult to escape that vacuum with a logical reasoning. That is partially due to this massive disconnect we have with our roots; with our culture. In this hyper commercial world we are not aware of what makes us “US” and how are we connected to the people and places around us. To find ourselves we need to journey inwards and replenish this cultural draught that has been going on for generations under the pretext of development and modernisation.</p>\n<p><img src=\"https://salilparekh.work/img/bvr-5.jpg\" alt=\"Conducting research with various communities in Mumbai\" /><br />\n<img src=\"https://salilparekh.work/img/bvr-12.jpg\" alt=\"Conducting research with various communities in Mumbai\" /><br />\n<img src=\"https://salilparekh.work/img/bvr-7.jpg\" alt=\"Conducting research with various communities in Mumbai\" /><br />\n<em>Conducting research with various communities in Mumbai</em></p>\n<p>Bambaiyya VR is funded by The Contemporary Take, Beyond Cultural Heritage Programme by the Prince Claus Fund and the British Council, which enables young people to engage with diverse cultural heritage within their own context and/or across six countries of South Asia (i.e. Afghanistan, Bangladesh, India, Nepal, Pakistan and Sri Lanka) through contemporary artistic and new media interventions.</p>\n<p>The core idea behind the narrative for Bambaiyya VR is the documentation of unique spaces in Mumbai that have stood the test of time but are now fading away due to rapid urbanisation. Tradition and culture make a place unique and interesting to live amidst. They should play a vital role in the redevelopment of a city. Unfortunately, in most cases these have been neglected. Cities are losing their essence and are turning into concrete jungles. We want to capture places in Mumbai that were once iconic in their prime but have now turned into a blur as the city moves on. Culture and traditions add so much of flavour to our everyday life in the form of festivals, food and colour. It pumps vibrancy into an otherwise monotonous lifestyle and also bridges generations by giving a topic to talk about. Culture and traditions can leave you with a richer and wholesome experience that is lacking in today pseudo society. This journey back in time will help you build/find a route to a more fulfilling future.</p>\n<p><img src=\"https://salilparekh.work/img/bvr-2.jpg\" alt=\"Initial VR sketches\" /><br />\n<em>Initial VR sketches</em></p>\n<p><img src=\"https://salilparekh.work/img/bvr-1.png\" alt=\"Capturing objects via photogrammetry\" /><br />\n<em>Capturing objects via photogrammetry</em></p>\n<p>During our research, we also started our pre-production. To create a VR film we needed media assets, which would be the building blocks of the film. Our lead artist, Archit Vaze drew the illustrated environments you see in virtual reality. To complement the illustrated worlds, we used a new and nascent process of Photogrammetry to digitally scan objects and use them in the VR experience. Photogrammetry is the use of photography to ascertain measurements between objects. It is the act of taking many photos of an object and calculating distances and angles to form a 3 dimensional model. This process is simple, yet yields accurate 3D geometry and high fidelity textures.</p>\n<p><img src=\"https://salilparekh.work/img/bvr-3.jpg\" alt=\"Digital interpretations of the Parsi Cafe experience\" /><br />\n<img src=\"https://salilparekh.work/img/bvr-4.png\" alt=\"Digital interpretations of the Parsi Cafe experience\" /><br />\n<em>Digital interpretations of the Parsi Cafe experience</em></p>\n<p>To build on the narrative of the city, the first task was to collect to talk to people and understand the heritage and culture of Mumbai. The research for Bambaiyya VR has underwent three phases.</p>\n<p>First: Finding out intriguing narratives that people must have overlooked, oral folk narratives that are very peculiar to specific communities, visual references of these narratives and spaces occupied by the communities became the major step to get a better understanding of the city. This process got us in contact with a few communities of the city namely, Koli, Bhandaris Pathare Prabhus, Jains &amp; Marwaris, Muslims, Parsis, Christians, Marathas, Mill workers, South Indians, Bene Israelis etc. All of these communities have contributed in their on ways to build the city as we see it today. The VR experience that would be created would be a collection of the various spaces that belong to them along with the oral narratives specific to these communities.</p>\n<p><img src=\"https://salilparekh.work/img/bvr-6.png\" alt=\"Chawls of Mumbai\" /><br />\n<em>Chawls of Mumbai</em></p>\n<p><img src=\"https://salilparekh.work/img/bvr-11.png#fullwidth\" alt=\"Kayani Cafe\" /><br />\n<em>Kayani Cafe</em></p>\n<p>Building on the narrative, the three communities on which work was started are the Koli Community, the original inhabitants, who provided their land to build Mumbai Parsi Community, the immigrants, who provided their money and administrative skills to build the city of Mumbai Mill Worker Community, the labourers, who provided their skill and hard work in the various industries to build Mumbai.</p>\n<p><img src=\"https://salilparekh.work/img/bvr-13.png\" alt=\"Stories of the three different communities\" /><br />\n<img src=\"https://salilparekh.work/img/bvr-14.png\" alt=\"Stories of the three different communities\" /><br />\n<em>Stories of the three different communities</em></p>\n<p>Bambaiyya VR has been touring India for the last year or so, so far being exhibited at the Godrej Cultural Lab (Mumbai 2018), The Irregulars Art Fair (Delhi 2019), Future Fiction (Bangalore and Mumbai 2019), Bhau Daji Lad Museum (Mumbai 2019), EyeMyth Media Arts Festival (Mumbai 2019), TIFA Cyberia (Pune 2019).</p>\n<p><img src=\"https://salilparekh.work/img/bvr-10.jpg#fullwidth\" alt=\"On display at Godrej Cultural Center, Mumbai\" /><br />\n<img src=\"https://salilparekh.work/img/bvr-8.jpg\" alt=\"On display at Godrej Cultural Center, Mumbai\" /><br />\n<em>On display at Godrej Cultural Center, Mumbai</em></p>\n<p><img src=\"https://salilparekh.work/img/bvr-16.jpg#fullwidth\" alt=\"On display at The Irregulars Art Fair, Delhi. Yes, the food is just as good in VR\" /><br />\n<img src=\"https://salilparekh.work/img/bvr-15.jpg\" alt=\"On display at The Irregulars Art Fair, Delhi. Yes, the food is just as good in VR\" /><br />\n<em>On display at The Irregulars Art Fair, Delhi. Yes, the food is just as good in VR</em></p>\n<h2>Press</h2>\n<p><a href=\"https://www.thehindu.com/news/cities/mumbai/bambaiyya-a-magic-carpet-tour-of-mumbai/article27158877.ece\">The Hindu: ‘Bambaiyya’: A magic carpet tour of Mumbai</a></p>\n<p><a href=\"https://www.mid-day.com/mumbai-guide/things-to-do/article/mumbai-up-close-and-personal-20060197\">Mid-Day: Mumbai, up close and personal</a></p>\n<p><a href=\"https://www.livemint.com/mint-lounge/features/this-summer-reconnect-with-your-city-through-quaint-experiences-1556266033027.html\">LiveMint: This summer, reconnect with your city through quaint experiences</a></p>\n",
      "date_published": "2018-02-20T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/gaming-youtube-algorithm/",
      "url": "https://salilparekh.work/posts/gaming-youtube-algorithm/",
      "title": "Gaming Youtube&#39;s Algorithms",
      "content_html": "<p><img src=\"https://salilparekh.work/img/youtube-1.gif\" alt=\"GIF of a browser rapidly loading and skipping youtube videos\" /></p>\n<p>Youtube's recommendation algorithms have always fascinated me. I don't know how they work, and nor does anyone else except the folks at Youtube I assume. But it doesn't mean I can't try to comprehend them with some software.</p>\n<p>One of the ways through which I can understand how the Youtube recommendation engine works, is to poke it with a stick and see how it reacts to my inputs. By varying how I poke the algorithm, I can attempt to understand how the algorithm works.</p>\n<p>To play around with the algorithm, I created a Google Chrome extension, which would skip to the next video once the page loads. I also added functionality to the extension, which would try and emulate behaviours of a regular viewer, such as selecting a random link from the list of recommended videos and varying the watch time of the video before skipping to the next page. By playing with these parameters, I tried to understand how the algorithm works.</p>\n<p>The expectation was to see how Youtube can go from a regular family friendly video to a dark video with dark and negative undertones. We've all heard stories of how children have stumbled upon Nazi propaganda or sexual content as they watch innocuously watch videos on Youtube. The aim was to observe how these recommendations would work, and see the interesting video content in between.</p>\n<p>Although I never quite got to see how that worked out, I did stumble upon some very interesting paths during my research. I realised that having an account, disabling watch history, and using proxies to spoof my location would also have an effect on my results, and I attempted to choose the combination which would provide for the highest delta in from the first video to the last.</p>\n<iframe width=\"100%\" height=\"315\" src=\"https://www.youtube.com/embed/p1TyrNrtP6I\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n<p>I did come across some very interesting content, which I have never seen before. Some of the more interesting content I came across were the children's videos I saw. Each of these videos consisted dancing animated 3D characters (from popular culture) in those videos dance to a generic soundtrack. Uploaded by a few creators, the bizarre creations had strange undertones, and Youtube would often direct me to these videos. Sometimes, I would also hit dead ends on Youtube. These were Youtube videos, with no further video recommendations. Those sections of the page would be completely greyed out! Or even more bizarre, those pages would have no content at all, except for the Youtube logo on top, and a blank, back frame in the middle.</p>\n<p>There is more investigation and exploring to be done, but this experiment led to some very interesting results!</p>\n",
      "date_published": "2018-01-02T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/stealing-headlines/",
      "url": "https://salilparekh.work/posts/stealing-headlines/",
      "title": "Stealing Headlines from the Internet",
      "content_html": "<p>For the Conspiracy Creation Workshop, I created fake headlines from an openly available Tensorflow LSTM machine learning algorithm. But perhaps the most difficult part of this process was collecting a corpus of headlines for the machine learning algorithm to train on!</p>\n<p>News websites are now quite complex, with highly intricate content management systems to store all the news on the website. With my limited skills, I was looking for a simple html based news provider, which would be easy prey for my algorithm. There aren't too many credible news providers in India, but luckily The Hindu was the perfect source for me.</p>\n<p>I created a small python script, which would cycle through all the days in the year of 2018, and only remove and store the headlines from every page from the website of The Hindu. After a few rounds of trial and error, I uploaded the script to an Amazon web server, and let it run for a few hours. It worked well, and I now had ~46MB of headlines in a .txt file.</p>\n<p><img src=\"https://salilparekh.work/img/conspiracy-textedit.png\" alt=\"List of real headlines printed on a TextEdit document\" /><br />\n<em>List of real headlines printed on a TextEdit document</em></p>\n<p>Now, to make my own headlines.</p>\n<p>I fired up the Tensorflow LSTM algorithm, and ran it on a GCP instance with some beefy GPU's to quicken the training process. LSTM doesn't perform really well on GPU's so it did take quite a bit of time, even on with a Tesla. Anyhow, I now had a well trained algorithm, which could spit out headlines on command! I downloaded the save files to my Mac, and used Tensorflow via Terminal to collect the newly generated headlines.</p>\n<p><img src=\"https://salilparekh.work/img/conspiracy-headlines.jpg\" alt=\"List of generated headlines printed on an A4 sheet with a post-it on it with the the text, Conspiracy\" /><br />\n<em>List of generated headlines from the Machine Learning algorithm</em></p>\n<p>This collection of fake headlines was valuable–especially for the Conspiracy Creation workshop–because it presented a wealth of possibilities. As a generative ideation exercise, this is about as good as it gets. These fake, machine learning generated headlines was also the basis of the Helf and Caree zine.</p>\n",
      "date_published": "2018-01-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/honeywell-aerospace-design-challenge/",
      "url": "https://salilparekh.work/posts/honeywell-aerospace-design-challenge/",
      "title": "Honeywell Aerospace Design Challenge",
      "content_html": "<p>The Honeywell Aerospace Design Challenge is an annual competition hosted by Honeywell Aerospace India. My collaborator, Harshika Jain and I have been participating for 3 years now, and in 2017 we got to the final round of the competition after previously being named as a special mention. I’ve always loved airplanes, and I really appreciated the chance to participate in a competition to see if my ideas have potential to make an impact.</p>\n<iframe width=\"100%\" height=\"320\" src=\"https://www.youtube.com/embed/cQ3R25_1jiw\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n<p><em>Project proposal video</em></p>\n<p>The theme for the 2017 edition was to come up with solutions to increase situational awareness of both pilots and ATC controllers. To understand the status quo, and the solutions currently being used, we interviewed multiple pilots and visited ATC controllers in the tower at the Ahmedabad Airport and the International Airport in Delhi. After our research, we designed two solutions to help increase situational awareness. The first part of the solution was to enhance the visualisation capabilities of ATC controllers, reducing their cognitive workload, stress levels, and give them the ability to make smarter decisions. Area ATC controllers (who control general airspace) would use a gesture controlled 3D map of the airspace to accurately determine distances and spot conflicts long before they occur. Tower and Ground ATC controllers (who control the airspace around the airport and on the airport) would have access to infrared capable cameras for better visualisation of the spaces they control. These solutions were driven from studying reports of various incidents and accidents to understand how a lack of situational awareness lead to these events taking place.</p>\n<p>The second part of the solution proposed a rapid voice-text-speech solution which would reduce the chances of miscommunication on radio frequencies. When we pored over hours of ATC-Pilot communications, and listened to tens of hours of conversations on frequency, along with pilot testaments, we narrowed in on the problem of radio interference, accents, and grammar affecting communication, which often led to close calls or accidents. Building on current technologies and projecting into the future of voice-text-speech solutions to propose a concept which would dramatically reduce miscommunication on radio. When the pilot, or ATC controller would make a statement on their radio, the onboard computer would transcribe their messages to text via a highly adaptable machine learning algorithm. This text would be sent to the recipient and be heard as a voice message. The transcription would not only transcribe the message, but attempt to normalise the message to a standardised format easily recognisable world over. This helps in situations where foreign pilots interact with ATC controllers in different country. Even though the format of communicating over radio is highly standardised, strong accents combined with radio interference can lead to miscommunication. Some areas have also evolved and adapted different ways of communicating the same messages, especially in areas with extreme terrain, and this may differ from the standardised message format. This solution hopes to reduce the adverse impact of these factors.</p>\n<p><img src=\"https://salilparekh.work/img/honeywell-3.jpeg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<img src=\"https://salilparekh.work/img/honeywell-4.jpeg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Our proposal</em></p>\n<p>Even though we finished runners-up in the final round, our solutions were highly appreciated by the senior engineering team at Honeywell.</p>\n<p><img src=\"https://salilparekh.work/img/honeywell-2.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n",
      "date_published": "2017-02-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/toolkits-dissemination/",
      "url": "https://salilparekh.work/posts/toolkits-dissemination/",
      "title": "Toolkits and Dissemination",
      "content_html": "<p><img src=\"https://salilparekh.work/img/toolkits.jpeg\" alt=\"Image of a few books about toolkits\" /></p>\n<p>The trickiest, but arguably the funnest bit of the project. Yes, funnest. Initially I had started off this project envisioning a toolkit as the end result. But what exactly is a toolkit? More accurately, a method toolkit is a collection of exercises and activities designed to propogate knowledge and scale impact of the same. Research and experiments conducted in one place are usually packaged into a toolkit in an attempt to replicate impact at scale.</p>\n<p>The aim is not to teach a man how to fish. The aim is to teach a man to teach himself how to fish. Toolkits are supposed to let the on-ground team replicate the methods used in the successful pilot. Although guided workshops are hosted to teach the process of using the toolkit, the onus is on the toolkit itself to be accessible enough to disseminate the information. Having read the wonderful essays by Akshay and Quicksand on toolkits, I’ve started to reconsider my approach toward a toolkit.</p>\n<p>My mistrust of toolkits started long before the project started. I would never use a toolkit unless I was mandated to, or in a workshop setting. The list of things I detest in toolkits is long, so I’ll focus on the big ones.</p>\n<p>The sheer inaccessibility of toolkits is the most frustrating. The language, the way the tools are structured and the tone of the content makes it seem cold, aloof, and almost academic. Then the lack of context is borderline criminal. Sure, it broadly works in a few situations, but there will always be exceptions and special cases.</p>\n<p>The merit of any toolkit is judged on how often is it used. If no one feels like using the tools then it has failed, no matter how technically resolved it may be. There is a caveat to add here: toolkits are always aimed at a very particular target audience, people who are in specific position at a specific time, doing a specific activity.</p>\n<p>I could be completely wrong about this, and statistics will probably prove so, there being enough numbers to prove the success of toolkits. But for me, personally, they simply don’t work and there are better ways of disseminating information. It’s also important to recognise that the method of dissemination should entirely depend on the target user, and not on the nature of the knowledge itself. Of course, in an ideal world every specific problem would have its own bespoke solution, but since that not going to happen anytime soon, we have to do the best we can with general solutions.</p>\n<p>In my poorly informed, highly inexperienced opinion, I feel that toolkits shouldn’t teach a fisherman how to fish, because unless you cover every single type of fishing technique, it’s not going to be a very helpful guide to those who aren’t in the same situation as described in the toolkit. What they should do is, to teach the principles and concepts of fishing. So that you can learn and develop your own unique fishing technique. So, teach a fisherman to teach himself how to fish. Everyone is creative in their own way, and will figure out solutions to their own particular problems when taught the basic principles and concepts.</p>\n<p>It’s a lot like mathematics. Once you learn the basic formulas, and learn how to derive them, you can then apply it to any problem. Another lesson I learnt from mathematics is that you have to understand the problem very well. Once you understand what the situation needs and requires, you can then use the necessary formula. Of course, real life is nothing like mathematics, there exist many complexities that no toolkit can handle.</p>\n<p>I really like reading case studies. HBR is a magazine that is full of them and I devour it the moment I can get my hands on a copy. On the face of it, case studies are just another layer of abstraction between the reader and the information. But that layer of abstraction gives the information context and tells the reader how it was relevant only in that context. So one can separate the context from the story with the additional understanding of knowing how it was used in context, hence giving a better understanding of the information. So I tend to understand concepts a whole lot better when presented to me in case studies. The power of narratives to explain a concept should never be underestimated.</p>\n<p>The other alternative is that we look at the other end of the spectrum by making a checklist of sorts, which the user can use as reference to get through the process. This would leave the entire process in the creative control of the said user, and would merely direct them in a particular order of things to do. This is suitable for a limited number of tasks/processes and would compromise on the quality of the process.</p>\n<p>At the other extreme, is to individually train people for the task that they’re trying to tackle and give them the knowledge and the ability to execute that know-how. This, of course is highly resource intensive but will guarantee results. Also, highly inefficient when trying to disseminate knowledge to scale up impact. The ideal solution lies somewhere at the multi-cross-section of these methods, and will change according to the broader context.</p>\n<p>I’m still trying to figure out the differences between lived experiences and reading about lived experiences. There is a light years of a difference in the impact it has on a person, that goes without saying. But in the context of learning from the said experiences, does it really make that much of a difference? Is learning from reading about mistakes just as effective as actually making those mistakes? Can I learn that its not healthy to touch boiling water from reading about it, just as much as I can by actually touching boiling water once and facing the consequences? As a rational, thoughtful individual, I’d like to think so. There are many strong arguments in favour of actually making the mistakes to learn from them once and for all. But perhaps, in a situation to educate about the dangers of a certain activity, just reading about a certain incident should be impactful enough.</p>\n",
      "date_published": "2017-01-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/holoplagiaristic-fatalism/",
      "url": "https://salilparekh.work/posts/holoplagiaristic-fatalism/",
      "title": "Holoplagiaristic Fatalism",
      "content_html": "<p>The final project of the last semester of the National Institute of Design entailed us to make a project on the future of festivals, specifically design festivals of 2034. This was a broader approach from which we could explore our own avenues. The first half of this 12-week project was spent researching the future, and imagining the world in 2034, and what form would festivals take in the future. The word itself, festivals has changed its meaning over the last century or so, but it still meant bringing people together.</p>\n<p>We collated our research into a zine, called <a href=\"https://issuu.com/salilparekh/docs/zine_rescued1\">Disquiet: 2034</a> ↗. This zine was imagined to be a zine from the year 2034, put together by students in the future, documenting the current events of the time. This zine served as a jump off point for us, and we each took a different direction into visualising one aspect of the future. Meghana and I were particularly interested in the future of art, as we felt art is what would dictate and define the visuals, the language, and the nature of entertainment.</p>\n<div class=\"two-grid\">\n<p><img src=\"https://salilparekh.work/img/holoplagiaristic-fatalism-6.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n<p><img src=\"https://salilparekh.work/img/holoplagiaristic-fatalism-2.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n<p><img src=\"https://salilparekh.work/img/holoplagiaristic-fatalism-3.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n<p><img src=\"https://salilparekh.work/img/holoplagiaristic-fatalism-4.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n</div>\n<p><em>spreads from the zine</em></p>\n<p><img src=\"https://salilparekh.work/img/holoplagiaristic-fatalism-1.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n<p><img src=\"https://salilparekh.work/img/holoplagiaristic-fatalism-7.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n<p>Our subsequent research into the future of art has been compiled into a document called <a href=\"https://issuu.com/meghanathakkar/docs/art_document\">Holoplagiaristic Fatalism</a> ↗, which serves as a manifesto for what we feel would be the prevalent art movement in 2034. It is difficult to comprehend and structurally predict the future of any discipline, let alone something as fluid and difficult to explain as art. There could be many possible futures, and this is us attempting to define one of them. The art movement of the future, called Holoplagiaristic Fatalism talks about a world saturated and overrun by content, where every creation is a derivative of another, and algorithm based bot-artists have run amok, destroying and democratising art. In this world, plagiarism is not only the norm, but is expected. The word plagiarism itself has taken on a new meaning, with a positive and creative connotation. The plagiarists manifesto in the document outlines the new rules of art, and defines the difference between positive and destructive plagiarism.</p>\n<div class=\"two-grid\">\n<p><img src=\"https://salilparekh.work/img/holoplagiaristic-fatalism-11.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n<p><img src=\"https://salilparekh.work/img/holoplagiaristic-fatalism-12.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n</div>\n<p>To communicate this research and the finer details of the Holoplagiaristic Fatalism art movement, we created a scenographic installation. We created a backstory in the context of 2034, for the creation of this art movement. The protagonist of the story was the creator of the art movement, Henry Dietrich Wolf. The space was the set of Henry’s work desk. Through the desk and the items on it – notebooks, sketch books, letter, a computer (music, emails, documents etc.), a viewer can discover the story of the man and the movement. The sample artwork we created, was hung in the space to complete the set (the creator of which was meant to be Henry). The set was meant to be an interactive and immersive experience that communicated the core principles and story of the art movement.</p>\n<p><img src=\"https://salilparekh.work/img/holoplagiaristic-fatalism-13.jpg#fullwidth\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>The desk of Henry Dietrich, the fictional founder of Holoplagiaristic Fatalism.</em></p>\n<p><img src=\"https://salilparekh.work/img/holoplagiaristic-fatalism-14.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>The viewer learns about the art movement by exploring the items on the desk</em></p>\n<p><img src=\"https://salilparekh.work/img/holoplagiaristic-fatalism-15.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n<p><img src=\"https://salilparekh.work/img/holoplagiaristic-fatalism-17.jpg#fullwidth\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Notes explaining the workings behind recursion in art</em></p>\n<p><img src=\"https://salilparekh.work/img/holoplagiaristic-fatalism-16.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n",
      "date_published": "2016-12-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/nid-bamboo-story/",
      "url": "https://salilparekh.work/posts/nid-bamboo-story/",
      "title": "The NID Bamboo Story",
      "content_html": "<p>My first ever exhibition opened right on time at the 2016 Convocation ceremony.</p>\n<p><img src=\"https://salilparekh.work/img/nid-bamboo-story-1.jpg#fullwidth\" alt=\"Exhibition at The Panorama at NID\" /><br />\n<em>Exhibition at The Panorama at NID</em></p>\n<p><img src=\"https://salilparekh.work/img/nid-bamboo-story-2.jpg\" alt=\"Exhibition note\" /><br />\n<em>Exhibition note</em></p>\n<p><img src=\"https://salilparekh.work/img/nid-bamboo-story-3.jpg\" alt=\"Bamboo objects from the archive\" /><br />\n<em>Bamboo objects from the archive</em></p>\n<p><img src=\"https://salilparekh.work/img/nid-bamboo-story-4.jpg#fullwidth\" alt=\"Bamboo objects from the archive\" /></p>\n<p><img src=\"https://salilparekh.work/img/nid-bamboo-story-5.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>The inimitable M.P. Ranjan</em></p>\n",
      "date_published": "2016-01-01T00:00:00Z"
    },{
      "id": "https://salilparekh.work/posts/bubbles%E2%80%93connecting-pols/",
      "url": "https://salilparekh.work/posts/bubbles%E2%80%93connecting-pols/",
      "title": "Bubbles–Connecting Pols",
      "content_html": "<p>The UnBox Caravan is a breakaway festival of the UnBox Festival, one of India’s few design festivals. The Caravan, supported by the Mozilla Foundation, brought together designers, technologists, digital activists, creative coders and craftspeople for two weeks in Ahmedabad. The senior Product Design and Exhibition Design batches worked together with the professional to learn how to work with Internet of Things (IoT) devices and create installations which would be exhibited at the Conflictorium, a museum which explores human conflicts.</p>\n<div class=\"two-grid\">\n<p><img src=\"https://salilparekh.work/img/bubbles-connecting-pols-19.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n<p><img src=\"https://salilparekh.work/img/bubbles-connecting-pols-17.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n<p><img src=\"https://salilparekh.work/img/bubbles-connecting-pols-13.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n<p><img src=\"https://salilparekh.work/img/bubbles-connecting-pols-10.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n</div>\n<p><em>Initial ideation</em></p>\n<p>We wanted to try and design an experience which could, if only for a moment masks these tensions, and get people to come together and enjoy their time together, however brief it may be for. The idea was simple. We wanted to get the children of these five communities to come together and interact with each other, for a brief moment. The children of these communities were discouraged from interacting with each other by their parents, and often led disparate lives, even though they were neighbours. We created a simple installation which would produce bubbles, yes, soap bubbles every time the viewers would interact with each other.</p>\n<div class=\"two-grid\">\n<p><img src=\"https://salilparekh.work/img/bubbles-connecting-pols-6.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n<p><img src=\"https://salilparekh.work/img/bubbles-connecting-pols-9.jpg\" alt=\"The inimitable M.P. Ranjan\" /></p>\n</div>\n<p><em>Bubbles making experiments</em></p>\n<p>To accomplish this, we created a simple bubble making machine attached to two foil balls. When the children would hold the foil balls and hold each others hands to complete the circuit, the bubble making machine would spin up and start creating bubbles! If any person broke the connection, the bubbles would stop. We weren’t sure if this would work, or if this would have any sort of impact. But to our surprise, we had children coming in by droves to see our installation and play with the bubbles. When they figured out that they had to hold hands to enjoy the bubbles, they started communicating, and interacting with one another to ensure the bubbles would keep coming. We saw some moments through day where the children worked together for those brief moments, before dispersing and going their separate ways.</p>\n<p><img src=\"https://salilparekh.work/img/bubbles-connecting-pols-1.jpg#fullwidth\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>The bubble maker in action</em></p>\n<p><img src=\"https://salilparekh.work/img/bubbles-connecting-pols-2.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>Happy outcomes</em></p>\n<p>A crash course in working with IoT and electronics quickly evolved into bubbles. The goal was to use our new tools to find ways to make an intervention in the community. Using quick and dirty prototypes we thought of an installation which would only activate when everyone would hold hands. The human circuit would then switch on the installations. Presenting the installations to children from deeply divided communities posed a challenge. To unite them, we got the children to hold hands with each other which would then activate the installations to produce bubbles! The kids, forgetting community divides, even for that brief moment, communicated and helped each other to hold hands to enjoy the bubbles.</p>\n<p><img src=\"https://salilparekh.work/img/bubbles-connecting-pols-5.jpg#fullwidth\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>The results were perhaps unexpected, but very welcome</em></p>\n<p><img src=\"https://salilparekh.work/img/bubbles-connecting-pols-8.jpg\" alt=\"The inimitable M.P. Ranjan\" /><br />\n<em>The team</em></p>\n",
      "date_published": "2016-01-01T00:00:00Z"
    }
  ]
}
